export const countries = [
  {
    id: 1,
    title: "Австралия",
    value: "Австралия",
  },
  {
    id: 2,
    title: "Австрия",
    value: "Австрия",
  },
  {
    id: 3,
    title: "Азербайджан",
    value: "Азербайджан",
  },
  {
    id: 4,
    title: "Албания",
    value: "Албания",
  },
  {
    id: 5,
    title: "Алжир",
    value: "Алжир",
  },
  {
    id: 6,
    title: "Ангола",
    value: "Ангола",
  },
  {
    id: 7,
    title: "Андорра",
    value: "Андорра",
  },
  {
    id: 8,
    title: "Антигуа и Барбуда",
    value: "Антигуа и Барбуда",
  },
  {
    id: 9,
    title: "Аргентина",
    value: "Аргентина",
  },
  {
    id: 10,
    title: "Армения",
    value: "Армения",
  },
  {
    id: 11,
    title: "Афганистан",
    value: "Афганистан",
  },
  {
    id: 12,
    title: "Багамы",
    value: "Багамы",
  },
  {
    id: 13,
    title: "Бангладеш",
    value: "Бангладеш",
  },
  {
    id: 14,
    title: "Барбадос",
    value: "Барбадос",
  },
  {
    id: 15,
    title: "Бахрейн",
    value: "Бахрейн",
  },
  {
    id: 16,
    title: "Белиз",
    value: "Белиз",
  },
  {
    id: 17,
    title: "Белоруссия",
    value: "Белоруссия",
  },
  {
    id: 18,
    title: "Бельгия",
    value: "Бельгия",
  },
  {
    id: 19,
    title: "Бенин",
    value: "Бенин",
  },
  {
    id: 20,
    title: "Болгария",
    value: "Болгария",
  },
  {
    id: 21,
    title: "Боливия",
    value: "Боливия",
  },
  {
    id: 22,
    title: "Босния и Герцеговина",
    value: "Босния и Герцеговина",
  },
  {
    id: 23,
    title: "Ботсвана",
    value: "Ботсвана",
  },
  {
    id: 24,
    title: "Бразилия",
    value: "Бразилия",
  },
  {
    id: 25,
    title: "Бруней",
    value: "Бруней",
  },
  {
    id: 26,
    title: "Буркина-Фасо",
    value: "Буркина-Фасо",
  },
  {
    id: 27,
    title: "Бурунди",
    value: "Бурунди",
  },
  {
    id: 28,
    title: "Бутан",
    value: "Бутан",
  },
  {
    id: 29,
    title: "Вануату",
    value: "Вануату",
  },
  {
    id: 30,
    title: "Великобритания",
    value: "Великобритания",
  },
  {
    id: 31,
    title: "Венгрия",
    value: "Венгрия",
  },
  {
    id: 32,
    title: "Венесуэла",
    value: "Венесуэла",
  },
  {
    id: 33,
    title: "Восточный Тимор",
    value: "Восточный Тимор",
  },
  {
    id: 34,
    title: "Вьетнам",
    value: "Вьетнам",
  },
  {
    id: 35,
    title: "Габон",
    value: "Габон",
  },
  {
    id: 36,
    title: "Гаити",
    value: "Гаити",
  },
  {
    id: 37,
    title: "Гайана",
    value: "Гайана",
  },
  {
    id: 38,
    title: "Гамбия",
    value: "Гамбия",
  },
  {
    id: 39,
    title: "Гана",
    value: "Гана",
  },
  {
    id: 40,
    title: "Гватемала",
    value: "Гватемала",
  },
  {
    id: 41,
    title: "Гвинея",
    value: "Гвинея",
  },
  {
    id: 42,
    title: "Гвинея-Бисау",
    value: "Гвинея-Бисау",
  },
  {
    id: 43,
    title: "Германия",
    value: "Германия",
  },
  {
    id: 44,
    title: "Гондурас",
    value: "Гондурас",
  },
  {
    id: 45,
    title: "Гренада",
    value: "Гренада",
  },
  {
    id: 46,
    title: "Греция",
    value: "Греция",
  },
  {
    id: 47,
    title: "Грузия",
    value: "Грузия",
  },
  {
    id: 48,
    title: "Дания",
    value: "Дания",
  },
  {
    id: 49,
    title: "Джибути",
    value: "Джибути",
  },
  {
    id: 50,
    title: "Доминика",
    value: "Доминика",
  },
  {
    id: 51,
    title: "Доминиканская Республика",
    value: "Доминиканская Республика",
  },
  {
    id: 52,
    title: "Египет",
    value: "Египет",
  },
  {
    id: 53,
    title: "Замбия",
    value: "Замбия",
  },
  {
    id: 54,
    title: "Зимбабве",
    value: "Зимбабве",
  },
  {
    id: 55,
    title: "Израиль",
    value: "Израиль",
  },
  {
    id: 56,
    title: "Индия",
    value: "Индия",
  },
  {
    id: 57,
    title: "Индонезия",
    value: "Индонезия",
  },
  {
    id: 58,
    title: "Иордания",
    value: "Иордания",
  },
  {
    id: 59,
    title: "Ирак",
    value: "Ирак",
  },
  {
    id: 60,
    title: "Иран",
    value: "Иран",
  },
  {
    id: 61,
    title: "Ирландия",
    value: "Ирландия",
  },
  {
    id: 62,
    title: "Исландия",
    value: "Исландия",
  },
  {
    id: 63,
    title: "Испания",
    value: "Испания",
  },
  {
    id: 64,
    title: "Италия",
    value: "Италия",
  },
  {
    id: 65,
    title: "Йемен",
    value: "Йемен",
  },
  {
    id: 66,
    title: "Кабо-Верде",
    value: "Кабо-Верде",
  },
  {
    id: 67,
    title: "Казахстан",
    value: "Казахстан",
  },
  {
    id: 68,
    title: "Камбоджа",
    value: "Камбоджа",
  },
  {
    id: 69,
    title: "Камерун",
    value: "Камерун",
  },
  {
    id: 70,
    title: "Канада",
    value: "Канада",
  },
  {
    id: 71,
    title: "Катар",
    value: "Катар",
  },
  {
    id: 72,
    title: "Кения",
    value: "Кения",
  },
  {
    id: 73,
    title: "Кипр",
    value: "Кипр",
  },
  {
    id: 74,
    title: "Киргизия",
    value: "Киргизия",
  },
  {
    id: 75,
    title: "Кирибати",
    value: "Кирибати",
  },
  {
    id: 76,
    title: "Китай",
    value: "Китай",
  },
  {
    id: 77,
    title: "КНДР",
    value: "КНДР",
  },
  {
    id: 78,
    title: "Колумбия",
    value: "Колумбия",
  },
  {
    id: 79,
    title: "Коморы",
    value: "Коморы",
  },
  {
    id: 80,
    title: "Конго",
    value: "Конго",
  },
  {
    id: 81,
    title: "ДР Конго",
    value: "ДР Конго",
  },
  {
    id: 82,
    title: "Корея",
    value: "Корея",
  },
  {
    id: 83,
    title: "Коста-Рика",
    value: "Коста-Рика",
  },
  {
    id: 84,
    title: "Кот-д’Ивуар",
    value: "Кот-д’Ивуар",
  },
  {
    id: 85,
    title: "Куба",
    value: "Куба",
  },
  {
    id: 86,
    title: "Кувейт",
    value: "Кувейт",
  },
  {
    id: 87,
    title: "Лаос",
    value: "Лаос",
  },
  {
    id: 88,
    title: "Латвия",
    value: "Латвия",
  },
  {
    id: 89,
    title: "Лесото",
    value: "Лесото",
  },
  {
    id: 90,
    title: "Либерия",
    value: "Либерия",
  },
  {
    id: 91,
    title: "Ливан",
    value: "Ливан",
  },
  {
    id: 92,
    title: "Ливия",
    value: "Ливия",
  },
  {
    id: 93,
    title: "Литва",
    value: "Литва",
  },
  {
    id: 94,
    title: "Лихтенштейн",
    value: "Лихтенштейн",
  },
  {
    id: 95,
    title: "Люксембург",
    value: "Люксембург",
  },
  {
    id: 96,
    title: "Маврикий",
    value: "Маврикий",
  },
  {
    id: 97,
    title: "Мавритания",
    value: "Мавритания",
  },
  {
    id: 98,
    title: "Мадагаскар",
    value: "Мадагаскар",
  },
  {
    id: 99,
    title: "Малави",
    value: "Малави",
  },
  {
    id: 100,
    title: "Малайзия",
    value: "Малайзия",
  },
  {
    id: 101,
    title: "Мали",
    value: "Мали",
  },
  {
    id: 102,
    title: "Мальдивы",
    value: "Мальдивы",
  },
  {
    id: 103,
    title: "Мальта",
    value: "Мальта",
  },
  {
    id: 104,
    title: "Марокко",
    value: "Марокко",
  },
  {
    id: 105,
    title: "Маршалловы Острова",
    value: "Маршалловы Острова",
  },
  {
    id: 106,
    title: "Мексика",
    value: "Мексика",
  },
  {
    id: 107,
    title: "Микронезия",
    value: "Микронезия",
  },
  {
    id: 108,
    title: "Мозамбик",
    value: "Мозамбик",
  },
  {
    id: 109,
    title: "Молдавия",
    value: "Молдавия",
  },
  {
    id: 110,
    title: "Монако",
    value: "Монако",
  },
  {
    id: 111,
    title: "Монголия",
    value: "Монголия",
  },
  {
    id: 112,
    title: "Мьянма",
    value: "Мьянма",
  },
  {
    id: 113,
    title: "Намибия",
    value: "Намибия",
  },
  {
    id: 114,
    title: "Науру",
    value: "Науру",
  },
  {
    id: 115,
    title: "Непал",
    value: "Непал",
  },
  {
    id: 116,
    title: "Нигер",
    value: "Нигер",
  },
  {
    id: 117,
    title: "Нигерия",
    value: "Нигерия",
  },
  {
    id: 118,
    title: "Нидерланды",
    value: "Нидерланды",
  },
  {
    id: 119,
    title: "Никарагуа",
    value: "Никарагуа",
  },
  {
    id: 120,
    title: "Новая Зеландия",
    value: "Новая Зеландия",
  },
  {
    id: 121,
    title: "Норвегия",
    value: "Норвегия",
  },
  {
    id: 122,
    title: "ОАЭ",
    value: "ОАЭ",
  },
  {
    id: 123,
    title: "Оман",
    value: "Оман",
  },
  {
    id: 124,
    title: "Пакистан",
    value: "Пакистан",
  },
  {
    id: 125,
    title: "Палау",
    value: "Палау",
  },
  {
    id: 126,
    title: "Панама",
    value: "Панама",
  },
  {
    id: 127,
    title: "Папуа — Новая Гвинея",
    value: "Папуа — Новая Гвинея",
  },
  {
    id: 128,
    title: "Парагвай",
    value: "Парагвай",
  },
  {
    id: 129,
    title: "Перу",
    value: "Перу",
  },
  {
    id: 130,
    title: "Польша",
    value: "Польша",
  },
  {
    id: 131,
    title: "Португалия",
    value: "Португалия",
  },
  {
    id: 132,
    title: "Россия",
    value: "Россия",
  },
  {
    id: 133,
    title: "Руанда",
    value: "Руанда",
  },
  {
    id: 134,
    title: "Румыния",
    value: "Румыния",
  },
  {
    id: 135,
    title: "Сальвадор",
    value: "Сальвадор",
  },
  {
    id: 136,
    title: "Самоа",
    value: "Самоа",
  },
  {
    id: 137,
    title: "Сан-Марино",
    value: "Сан-Марино",
  },
  {
    id: 138,
    title: "Сан-Томе и Принсипи",
    value: "Сан-Томе и Принсипи",
  },
  {
    id: 139,
    title: "Саудовская Аравия",
    value: "Саудовская Аравия",
  },
  {
    id: 140,
    title: "Северная Македония",
    value: "Северная Македония",
  },
  {
    id: 141,
    title: "Сейшелы",
    value: "Сейшелы",
  },
  {
    id: 142,
    title: "Сенегал",
    value: "Сенегал",
  },
  {
    id: 143,
    title: "Сент-Винсент и Гренадины",
    value: "Сент-Винсент и Гренадины",
  },
  {
    id: 144,
    title: "Сент-Китс и Невис",
    value: "Сент-Китс и Невис",
  },
  {
    id: 145,
    title: "Сент-Люсия",
    value: "Сент-Люсия",
  },
  {
    id: 146,
    title: "Сербия",
    value: "Сербия",
  },
  {
    id: 147,
    title: "Сингапур",
    value: "Сингапур",
  },
  {
    id: 148,
    title: "Сирия",
    value: "Сирия",
  },
  {
    id: 149,
    title: "Словакия",
    value: "Словакия",
  },
  {
    id: 150,
    title: "Словения",
    value: "Словения",
  },
  {
    id: 151,
    title: "США",
    value: "США",
  },
  {
    id: 152,
    title: "Соломоновы Острова",
    value: "Соломоновы Острова",
  },
  {
    id: 153,
    title: "Сомали",
    value: "Сомали",
  },
  {
    id: 154,
    title: "Судан",
    value: "Судан",
  },
  {
    id: 155,
    title: "Суринам",
    value: "Суринам",
  },
  {
    id: 156,
    title: "Сьерра-Леоне",
    value: "Сьерра-Леоне",
  },
  {
    id: 157,
    title: "Таджикистан",
    value: "Таджикистан",
  },
  {
    id: 158,
    title: "Таиланд",
    value: "Таиланд",
  },
  {
    id: 159,
    title: "Танзания",
    value: "Танзания",
  },
  {
    id: 160,
    title: "Того",
    value: "Того",
  },
  {
    id: 161,
    title: "Тонга",
    value: "Тонга",
  },
  {
    id: 162,
    title: "Тринидад и Тобаго",
    value: "Тринидад и Тобаго",
  },
  {
    id: 163,
    title: "Тувалу",
    value: "Тувалу",
  },
  {
    id: 164,
    title: "Тунис",
    value: "Тунис",
  },
  {
    id: 165,
    title: "Туркмения",
    value: "Туркмения",
  },
  {
    id: 166,
    title: "Турция",
    value: "Турция",
  },
  {
    id: 167,
    title: "Уганда",
    value: "Уганда",
  },
  {
    id: 168,
    title: "Узбекистан",
    value: "Узбекистан",
  },
  {
    id: 169,
    title: "Украина",
    value: "Украина",
  },
  {
    id: 170,
    title: "Уругвай",
    value: "Уругвай",
  },
  {
    id: 171,
    title: "Фиджи",
    value: "Фиджи",
  },
  {
    id: 172,
    title: "Филиппины",
    value: "Филиппины",
  },
  {
    id: 173,
    title: "Финляндия",
    value: "Финляндия",
  },
  {
    id: 174,
    title: "Франция",
    value: "Франция",
  },
  {
    id: 175,
    title: "Хорватия",
    value: "Хорватия",
  },
  {
    id: 176,
    title: "ЦАР",
    value: "ЦАР",
  },
  {
    id: 177,
    title: "Чад",
    value: "Чад",
  },
  {
    id: 178,
    title: "Черногория",
    value: "Черногория",
  },
  {
    id: 179,
    title: "Чехия",
    value: "Чехия",
  },
  {
    id: 180,
    title: "Чили",
    value: "Чили",
  },
  {
    id: 181,
    title: "Швейцария",
    value: "Швейцария",
  },
  {
    id: 182,
    title: "Швеция",
    value: "Швеция",
  },
  {
    id: 183,
    title: "Шри-Ланка",
    value: "Шри-Ланка",
  },
  {
    id: 184,
    title: "Эквадор",
    value: "Эквадор",
  },
  {
    id: 185,
    title: "Экваториальная Гвинея",
    value: "Экваториальная Гвинея",
  },
  {
    id: 186,
    title: "Эритрея",
    value: "Эритрея",
  },
  {
    id: 187,
    title: "Эсватини",
    value: "Эсватини",
  },
  {
    id: 188,
    title: "Эстония",
    value: "Эстония",
  },
  {
    id: 189,
    title: "Эфиопия",
    value: "Эфиопия",
  },
  {
    id: 190,
    title: "ЮАР",
    value: "ЮАР",
  },
  {
    id: 191,
    title: "Южный Судан",
    value: "Южный Судан",
  },
  {
    id: 192,
    title: "Ямайка",
    value: "Ямайка",
  },
  {
    id: 193,
    title: "Япония",
    value: "Япония",
  },
];

export const measurementArea = [
  {
    id: "1",
    title: "Измерения геометрические",
    value: "Измерения геометрические",
  },
  {
    id: "2",
    title: "Измерения механические",
    value: "Измерения механические",
  },
  {
    id: "3",
    title: "Измерения расхода, вместимости, уровня, параметров потока",
    value: "Измерения расхода, вместимости, уровня, параметров потока",
  },
  {
    id: "4",
    title: "Измерения давления и вакуума",
    value: "Измерения давления и вакуума",
  },
  {
    id: "5",
    title: "Измерения физико-химические",
    value: "Измерения физико-химические",
  },
  {
    id: "6",
    title: "Измерения температурные и теплофизические",
    value: "Измерения температурные и теплофизические",
  },
  {
    id: "7",
    title: "Измерения времени и частоты",
    value: "Измерения времени и частоты",
  },
  {
    id: "8",
    title: "Измерения электрические и магнитные",
    value: "Измерения электрические и магнитные",
  },
  {
    id: "9",
    title: "Измерения радиоэлектронные",
    value: "Измерения радиоэлектронные",
  },
  {
    id: "10",
    title: "Измерения виброакустические",
    value: "Измерения виброакустические",
  },
  {
    id: "11",
    title: "Измерения оптические и отпико-физические",
    value: "Измерения оптические и отпико-физические",
  },
  {
    id: "12",
    title: "Измерения параметров ионизирующих излучений",
    value: "Измерения параметров ионизирующих излучений",
  },
  {
    id: "13",
    title: "Измерения биологические и биомедицинские",
    value: "Измерения биологические и биомедицинские",
  },
];

export const measurementType = [
  {
    id: "1",
    title: "Измерения линейных величин",
    value: "Измерения линейных величин",
  },
  {
    id: "2",
    title: "Измерения угловых величин",
    value: "Измерения угловых величин",
  },
  {
    id: "3",
    title: "Измерения массы",
    value: "Измерения массы",
  },
  {
    id: "4",
    title: "Измерения силы, твердости, силы тяжести",
    value: "Измерения силы, твердости, силы тяжести",
  },
  {
    id: "5",
    title: "Измерения параметров движения",
    value: "Измерения параметров движения",
  },
  {
    id: "6",
    title: "Измерения деформаций, моментов сил, работы, мощности",
    value: "Измерения деформаций, моментов сил, работы, мощности",
  },
  {
    id: "7",
    title: "Измерения системы автосервиса",
    value: "Измерения системы автосервиса",
  },
  {
    id: "8",
    title: "Измерения расхода газов, жидкостей,пара, газожидкостных систем",
    value: "Измерения расхода газов, жидкостей,пара, газожидкостных систем",
  },
  {
    id: "9",
    title: "Измерения уровня, объема, вместимости",
    value: "Измерения уровня, объема, вместимости",
  },
  {
    id: "10",
    title: "Измерения давления, вакуумные",
    value: "Измерения давления, вакуумные",
  },
  {
    id: "11",
    title: "Физико-химические измерения состава твёрдых тел, жидкостей, газов",
    value: "Физико-химические измерения состава твёрдых тел, жидкостей, газов",
  },
  {
    id: "12",
    title:
      "Измерения свойств твёрдых тел, сыпучих веществ, жидкостей, морской воды, нефти",
    value:
      "Измерения свойств твёрдых тел, сыпучих веществ, жидкостей, морской воды, нефти",
  },
  {
    id: "13",
    title: "Измерения количества теплоты реакций и фазовых переходов",
    value: "Измерения количества теплоты реакций и фазовых переходов",
  },
  {
    id: "14",
    title:
      "Измерения температур, в т.ч. низких (ниже 273,15 К) и высоких (более 3000 К)",
    value:
      "Измерения температур, в т.ч. низких (ниже 273,15 К) и высоких (более 3000 К)",
  },
  {
    id: "15",
    title: "Методы и средства воспроизведения и хранения времени и частоты",
    value: "Методы и средства воспроизведения и хранения времени и частоты",
  },
  {
    id: "16",
    title: "Измерения интервалов времени",
    value: "Измерения интервалов времени",
  },
  {
    id: "17",
    title: "Измерения частоты сигналов",
    value: "Измерения частоты сигналов",
  },
  {
    id: "18",
    title: "Измерения параметров телефонной связи, в т.ч. сотовой",
    value: "Измерения параметров телефонной связи, в т.ч. сотовой",
  },
  {
    id: "19",
    title: "Измерения энергетических параметров",
    value: "Измерения энергетических параметров",
  },
  {
    id: "20",
    title:
      "Измерения электрического сопротивления, проводимости, емкости, угла сдвига фаз",
    value:
      "Измерения электрического сопротивления, проводимости, емкости, угла сдвига фаз",
  },
  {
    id: "21",
    title:
      "Измерения характеристик магнитных полей, свойств магнитных материалов",
    value:
      "Измерения характеристик магнитных полей, свойств магнитных материалов",
  },
  {
    id: "22",
    title: "Измерения и исследования формы сигнала и спектра",
    value: "Измерения и исследования формы сигнала и спектра",
  },
  {
    id: "23",
    title: "Измерения ослаблений. Аттенюаторы.",
    value: "Измерения ослаблений. Аттенюаторы.",
  },
  {
    id: "24",
    title: "Генераторы измерительные",
    value: "Генераторы измерительные",
  },
  {
    id: "25",
    title:
      "Измерения элементов и трактов с распределенными постоянными (# рефлектометры)",
    value:
      "Измерения элементов и трактов с распределенными постоянными (# рефлектометры)",
  },
  {
    id: "26",
    title: "Приборы для наблюдения и исследования характеристик радиоустройств",
    value: "Приборы для наблюдения и исследования характеристик радиоустройств",
  },
  {
    id: "27",
    title: "Измерения параметров электронных ламп и полупроводниковых приборов",
    value: "Измерения параметров электронных ламп и полупроводниковых приборов",
  },
  {
    id: "28",
    title:
      "Измерительные устройства коаксиальных и волноводных трактов (#вентили коаксиальные)",
    value:
      "Измерительные устройства коаксиальных и волноводных трактов (#вентили коаксиальные)",
  },
  {
    id: "29",
    title: "Измерения мощности",
    value: "Измерения мощности",
  },
  {
    id: "30",
    title: "Измерения напряжений",
    value: "Измерения напряжений",
  },
  {
    id: "31",
    title: "Измерения напряженности поля и радиопомех",
    value: "Измерения напряженности поля и радиопомех",
  },
  {
    id: "32",
    title: "Импульсные измерения",
    value: "Импульсные измерения",
  },
  {
    id: "33",
    title: "Измерения разности фаз и группового времени запаздывания",
    value: "Измерения разности фаз и группового времени запаздывания",
  },
  {
    id: "34",
    title: "Усилители измерительные",
    value: "Усилители измерительные",
  },
  {
    id: "35",
    title: "Блоки радиоизмерительных приборов",
    value: "Блоки радиоизмерительных приборов",
  },
  {
    id: "36",
    title: "Источники питания для измерения и радиоизмерительных приборов",
    value: "Источники питания для измерения и радиоизмерительных приборов",
  },
  {
    id: "37",
    title:
      "Измерения параметров компонентов и цепей с сосредоточенными постоянными (#мегомметры)",
    value:
      "Измерения параметров компонентов и цепей с сосредоточенными постоянными (#мегомметры)",
  },
  {
    id: "38",
    title: "Комплексные измерительные установки",
    мфдгу: "Комплексные измерительные установки",
  },
  {
    id: "40",
    title: "Измерения акустических величин",
    value: "Измерения акустических величин",
  },
  {
    id: "41",
    title: "Оптические и оптико-физические измерения",
    value: "Оптические и оптико-физические измерения",
  },
  {
    id: "42",
    title:
      "Измерения активности, характеристик полей и источников нейтронов (радиометрия) (#детекторы, спектрометры)",
    value:
      "Измерения активности, характеристик полей и источников нейтронов (радиометрия) (#детекторы, спектрометры)",
  },
  {
    id: "43",
    title: "Измерения доз ионизирующих излучений (дозиметрия)",
    value: "Измерения доз ионизирующих излучений (дозиметрия)",
  },
  {
    id: "44",
    title: "Электронно-физическая аппаратура",
    value: "Электронно-физическая аппаратура",
  },
  {
    id: "45",
    title: "Средства измерения медицинского назначения",
    value: "Средства измерения медицинского назначения",
  },
  {
    id: "39",
    title: "Прочие (радиоэлектронные измерения (#тестеры))",
    value: "Прочие (радиоэлектронные измерения (#тестеры))",
  },
];

export const measureGroup = [
  {
    id: "1",
    title: "Средства измерения давления и вакуума",
    value: "Средства измерения давления и вакуума",
    disabled: true,
    children: [
      {
        id: "1",
        title: "Датчики давления",
        value: "Датчики давления",
      },
      {
        id: "2",
        title:
          "Манометры, вакуумметры, мановакуумметры, напоромеры, тягомеры и тягонапоромеры",
        value:
          "Манометры, вакуумметры, мановакуумметры, напоромеры, тягомеры и тягонапоромеры",
      },
    ],
  },
  {
    id: "2",
    title: "Средства измерения температуры",
    value: "Средства измерения температуры",
    disabled: true,
    children: [
      {
        id: "3",
        title: "Термометры стеклянные жидкостные",
        value: "Термометры стеклянные жидкостные",
      },
      {
        id: "4",
        title: "Термометры показывающие, биметаллические, манометрические",
        value: "Термометры показывающие, биметаллические, манометрические",
      },
      {
        id: "5",
        title: "Термометры сопротивления",
        value: "Термометры сопротивления",
      },
      {
        id: "6",
        title: "Термопары, преобразователи термоэлектрические",
        value: "Термопары, преобразователи термоэлектрические",
      },
      {
        id: "7",
        title: "Датчики температуры с унифицированным выходным сигналом",
        value: "Датчики температуры с унифицированным выходным сигналом",
      },
      {
        id: "8",
        title:
          "Преобразователи измерительные сигналов термометров сопротивления и термоэлектрических преобразователей",
        value:
          "Преобразователи измерительные сигналов термометров сопротивления и термоэлектрических преобразователей",
      },
    ],
  },
  {
    id: "3",
    title: "Средства измерения расхода, вместимости, уровня, параметров потока",
    value: "Средства измерения расхода, вместимости, уровня, параметров потока",
    disabled: true,
    children: [
      {
        id: "9",
        title: "Счетчики, расходомеры жидкости объемные (проливной метод)",
        value: "Счетчики, расходомеры жидкости объемные (проливной метод)",
      },
      {
        id: "10",
        title: "Счетчики, расходомеры жидкости объемные (имитационный метод)",
        value: "Счетчики, расходомеры жидкости объемные (имитационный метод)",
      },
      {
        id: "11",
        title: "Счетчики, расходомеры жидкости  массовые",
        value: "Счетчики, расходомеры жидкости  массовые",
      },
      {
        id: "12",
        title: "Счетчики, расходомеры газа (проливной метод)",
        value: "Счетчики, расходомеры газа (проливной метод)",
      },
      {
        id: "13",
        title: "Счетчики, расходомеры газа (имитационный метод)",
        value: "Счетчики, расходомеры газа (имитационный метод)",
      },
      {
        id: "14",
        title: "ТПУ, пруверы",
        value: "ТПУ, пруверы",
      },
      {
        id: "15",
        title: "Топливо-раздаточные колонки",
        value: "Топливо-раздаточные колонки",
      },
      {
        id: "16",
        title: "Системы и узлы учета жидкости (СИКН, СИКНС, СИКНП)",
        value: "Системы и узлы учета жидкости (СИКН, СИКНС, СИКНП)",
      },
      {
        id: "17",
        title: "Системы учета жидкости в резервуарах",
        value: "Системы учета жидкости в резервуарах",
      },
      {
        id: "18",
        title: "Системы и узлы учета газа (СИКГ)",
        value: "Системы и узлы учета газа (СИКГ)",
      },
      {
        id: "19",
        title: "Автоматические групповые замерные установки",
        value: "Автоматические групповые замерные установки",
      },
      {
        id: "20",
        title: "Вторичная аппаратура, вычислительные комплексы, контроллеры",
        value: "Вторичная аппаратура, вычислительные комплексы, контроллеры",
      },
      {
        id: "21",
        title: "Мерники",
        value: "Мерники",
      },
      {
        id: "23",
        title: "Уровнемеры",
        value: "Уровнемеры",
      },
      {
        id: "24",
        title: "Резервуары горизонтальные цилиндрические",
        value: "Резервуары горизонтальные цилиндрические",
      },
      {
        id: "25",
        title: "Резервуары вертикальные цилиндрические",
        value: "Резервуары вертикальные цилиндрические",
      },
    ],
  },
  {
    id: "6",
    title: "Средства измерения физико-химического состава и свойств",
    value: "Средства измерения физико-химического состава и свойств",
    disabled: true,
    children: [
      {
        id: "33",
        title: "Вискозиметры поточные",
        value: "Вискозиметры поточные",
      },
      {
        id: "34",
        title: "Газоанализаторы (стационарные)",
        value: "Газоанализаторы (стационарные)",
      },
      {
        id: "35",
        title: "Газоанализаторы (переносные)",
        value: "Газоанализаторы (переносные)",
      },
      {
        id: "36",
        title: "Гигрометры, анализаторы влажности газов",
        value: "Гигрометры, анализаторы влажности газов",
      },
      {
        id: "37",
        title: "Хроматографы газовые",
        value: "Хроматографы газовые",
      },
      {
        id: "38",
        title: "Анализаторы содержания серы в нефти и нефтепродуктах",
        value: "Анализаторы содержания серы в нефти и нефтепродуктах",
      },
      {
        id: "39",
        title: "Средства измерений химико-аналитических лабораторий",
        value: "Средства измерений химико-аналитических лабораторий",
      },
      {
        id: "29",
        title: "Плотномеры жидкости",
        value: "Плотномеры жидкости",
      },
      {
        id: "30",
        title: "Плотномеры газа",
        value: "Плотномеры газа",
      },
      {
        id: "31",
        title: "Влагомеры нефти и нефтепродуктов",
        value: "Влагомеры нефти и нефтепродуктов",
      },
    ],
  },
  {
    id: "7",
    title: "Прочее",
    value: "Прочее",
    disabled: true,
  },
  {
    id: "4",
    title: "Средства измерения механических величин",
    value: "Средства измерения механических величин",
    disabled: true,
    children: [
      {
        id: "26",
        title: "Весы",
        value: "Весы",
      },
      {
        id: "27",
        title: "Гири",
        value: "Гири",
      },
    ],
  },
  {
    id: "5",
    title: "Средства измерения вибрации",
    value: "Средства измерения вибрации",
    disabled: true,
    children: [
      {
        id: "28",
        title:
          "СИ виброскорости, виброускорения, виброперемещения, осевого сдвига",
        value:
          "СИ виброскорости, виброускорения, виброперемещения, осевого сдвига",
      },
    ],
  },
];

export const sgroei = [
  {
    id: "1",
    title: "Осуществление деятельности в области здравоохранения",
    value: "Осуществление деятельности в области здравоохранения",
  },
  {
    id: "2",
    title: "Осуществление ветеринарной деятельности",
  },
  {
    id: "3",
    title: "Осуществление деятельности в области охраны окружающей среды",
    value: "Осуществление деятельности в области охраны окружающей среды",
  },
  {
    id: "4",
    title:
      "Осуществление деятельности в области гражданской обороны, защиты населения и территорий от чрезвычайных ситуаций природного и техногенного характера, обеспечения пожарной безопасности, безопасности людей на водных объектах",
    value:
      "Осуществление деятельности в области гражданской обороны, защиты населения и территорий от чрезвычайных ситуаций природного и техногенного характера, обеспечения пожарной безопасности, безопасности людей на водных объектах",
  },
  {
    id: "5",
    title: "Выполнение работ по обеспечению безопасных условий и охраны труда",
    value: "Выполнение работ по обеспечению безопасных условий и охраны труда",
  },
  {
    id: "6",
    title:
      "Осуществление производственного контроля за соблюдением установленных законодательством Российской Федерации требований промышленной безопасности к эксплуатации опасного производственного объекта",
    value:
      "Осуществление производственного контроля за соблюдением установленных законодательством Российской Федерации требований промышленной безопасности к эксплуатации опасного производственного объекта",
  },
  {
    id: "7",
    title: "Осуществление торговли, выполнение работ по расфасовке товаров",
    value: "Осуществление торговли, выполнение работ по расфасовке товаров",
  },
  {
    id: "8",
    title:
      "Выполнение государственных учетных операций и учет количества энергетических ресурсов",
    value:
      "Выполнение государственных учетных операций и учет количества энергетических ресурсов",
  },
  {
    id: "9",
    title:
      "Оказание услуг почтовой связи, учет объема оказанных услуг электросвязи операторами связи и обеспечение целостности и устойчивости функционирования сети связи общего пользования",
    value:
      "Оказание услуг почтовой связи, учет объема оказанных услуг электросвязи операторами связи и обеспечение целостности и устойчивости функционирования сети связи общего пользования",
  },
  {
    id: "10",
    title: "Осуществление геодезической и картографической деятельности",
    value: "Осуществление геодезической и картографической деятельности",
  },
  {
    id: "11",
    title:
      "Осуществление деятельности в области гидрометеорологии, мониторинга состояния и загрязнения окружающей среды",
    value:
      "Осуществление деятельности в области гидрометеорологии, мониторинга состояния и загрязнения окружающей среды",
  },
  {
    id: "12",
    title:
      "Проведение банковских, налоговых, таможенных операций и таможенного контроля",
    value:
      "Проведение банковских, налоговых, таможенных операций и таможенного контроля",
  },
  {
    id: "13",
    title:
      "Выполнение работ по оценке соответствия продукции и иных объектов обязательным требованиям в соответствии с законодательством Российской Федерации о техническом регулировании",
    value:
      "Выполнение работ по оценке соответствия продукции и иных объектов обязательным требованиям в соответствии с законодательством Российской Федерации о техническом регулировании",
  },
  {
    id: "14",
    title:
      "Проведение официальных спортивных соревнований, обеспечении подготовки спортсменов высокого класса",
    value:
      "Проведение официальных спортивных соревнований, обеспечении подготовки спортсменов высокого класса",
  },
  {
    id: "15",
    title:
      "Выполнение поручений суда, органов прокуратуры, государственных органов исполнительной власти",
    value:
      "Выполнение поручений суда, органов прокуратуры, государственных органов исполнительной власти",
  },
  {
    id: "16",
    title: "Осуществление мероприятий государственного контроля (надзора)",
    value: "Осуществление мероприятий государственного контроля (надзора)",
  },
  {
    id: "17",
    title: "Осуществление деятельности в области использования атомной энергии",
    value: "Осуществление деятельности в области использования атомной энергии",
  },
  {
    id: "18",
    title: "Обеспечение безопасности дорожного движения",
    value: "Обеспечение безопасности дорожного движения",
  },
  {
    id: "19",
    title:
      "Измерения, предусмотренные законодательством Российской Федерации о техническом регулировании",
    value:
      "Измерения, предусмотренные законодательством Российской Федерации о техническом регулировании",
  },
  {
    id: "20",
    title:
      "Единицы величин, эталоны единиц величин, стандартные образцы и средства измерений, к которым установлены обязательные требования",
    value:
      "Единицы величин, эталоны единиц величин, стандартные образцы и средства измерений, к которым установлены обязательные требования",
  },
  {
    id: "21",
    title:
      "Деятельность вне сферы государственного регулирования обеспечения единства измерений",
    value:
      "Деятельность вне сферы государственного регулирования обеспечения единства измерений",
  },
];

export const metrologyDocumentType = [
  {
    id: 1,
    title: "Извещение о непригодности",
    value: "Извещение о непригодности",
  },
  {
    id: 2,
    title: "Клеймо",
    value: "Клеймо",
  },
  {
    id: 3,
    title: "Паспорт",
    value: "Паспорт",
  },
  {
    id: 4,
    title: "Свидетельство о поверке",
    value: "Свидетельство о поверке",
  },
  {
    id: 5,
    title: "Сертификат калибровки",
    value: "Сертификат калибровки",
  },
];

export const metrologyStatus = [
  {
    id: 1,
    title: "В поверке/калибровке",
    value: "В поверке/калибровке",
  },
  {
    id: 2,
    title: "В работе",
    value: "В работе",
  },
  {
    id: 3,
    title: "В ремонте",
    value: "В ремонте",
  },
  {
    id: 4,
    title: "Консервация",
    value: "Консервация",
  },
  {
    id: 5,
    title: "Непригоден",
    value: "Непригоден",
  },
  {
    id: 6,
    title: "Списан",
    value: "Списан",
  },
];