import { SummaryListOfEquipmentView } from "../../../../../common/types/equipment-accounting";

export const sgroei = [
  {
    id: "1",
    title: "Осуществление деятельности в области здравоохранения",
  },
  {
    id: "2",
    title: "Осуществление ветеринарной деятельности",
  },
  {
    id: "3",
    title: "Осуществление деятельности в области охраны окружающей среды",
  },
  {
    id: "4",
    title:
      "Осуществление деятельности в области гражданской обороны, защиты населения и территорий от чрезвычайных ситуаций природного и техногенного характера, обеспечения пожарной безопасности, безопасности людей на водных объектах",
  },
  {
    id: "5",
    title: "Выполнение работ по обеспечению безопасных условий и охраны труда",
  },
  {
    id: "6",
    title:
      "Осуществление производственного контроля за соблюдением установленных законодательством Российской Федерации требований промышленной безопасности к эксплуатации опасного производственного объекта",
  },
  {
    id: "7",
    title: "Осуществление торговли, выполнение работ по расфасовке товаров",
  },
  {
    id: "8",
    title:
      "Выполнение государственных учетных операций и учет количества энергетических ресурсов",
  },
  {
    id: "9",
    title:
      "Оказание услуг почтовой связи, учет объема оказанных услуг электросвязи операторами связи и обеспечение целостности и устойчивости функционирования сети связи общего пользования",
  },
  {
    id: "10",
    title: "Осуществление геодезической и картографической деятельности",
  },
  {
    id: "11",
    title:
      "Осуществление деятельности в области гидрометеорологии, мониторинга состояния и загрязнения окружающей среды",
  },
  {
    id: "12",
    title:
      "Проведение банковских, налоговых, таможенных операций и таможенного контроля",
  },
  {
    id: "13",
    title:
      "Выполнение работ по оценке соответствия продукции и иных объектов обязательным требованиям в соответствии с законодательством Российской Федерации о техническом регулировании",
  },
  {
    id: "14",
    title:
      "Проведение официальных спортивных соревнований, обеспечении подготовки спортсменов высокого класса",
  },
  {
    id: "15",
    title:
      "Выполнение поручений суда, органов прокуратуры, государственных органов исполнительной власти",
  },
  {
    id: "16",
    title: "Осуществление мероприятий государственного контроля (надзора)",
  },
  {
    id: "17",
    title: "Осуществление деятельности в области использования атомной энергии",
  },
  {
    id: "18",
    title: "Обеспечение безопасности дорожного движения",
  },
  {
    id: "19",
    title:
      "Измерения, предусмотренные законодательством Российской Федерации о техническом регулировании",
  },
  {
    id: "20",
    title:
      "Единицы величин, эталоны единиц величин, стандартные образцы и средства измерений, к которым установлены обязательные требования",
  },
  {
    id: "21",
    title:
      "Деятельность вне сферы государственного регулирования обеспечения единства измерений",
  },
];

export const metrologyDocumentType = [
  {
    id: 1,
    title: "Извещение о непригодности",
  },
  {
    id: 2,
    title: "Клеймо",
  },
  {
    id: 3,
    title: "Паспорт",
  },
  {
    id: 4,
    title: "Свидетельство о поверке",
  },
  {
    id: 5,
    title: "Сертификат калибровки",
  },
];

export const counterpartyView = [
  {
    id: "2",
    title: "АО «Шнейдер Электрик» ",
  },
  {
    id: "3",
    title: "АО «Электронмаш»",
  },
  {
    id: "4",
    title: "ООО «Магнум»",
  },
  {
    id: "5",
    title: "ООО «Системы нефть и газ»",
  },
  {
    id: "6",
    title: "АО «Уралтехнострой-Туймазыхиммаш»",
  },
  {
    id: "7",
    title: "АО «Сибком»",
  },
  {
    id: "8",
    title: "ООО «Автоматизация-Метрология-ЭКСПЕРТ»",
  },
  {
    id: "9",
    title: "ООО «НПФ Система-сервис»",
  },
  {
    id: "10",
    title: "АО «Чебоксарский электроаппаратный завод»",
  },
  {
    id: "11",
    title: "АО «Завод Электропульт»",
  },
  {
    id: "12",
    title: "АО «Трубная металлургическая компания»",
  },
  {
    id: "13",
    title: "ООО «Компания «ТЕХНОТЕКС»",
  },
  {
    id: "14",
    title: "ООО «Компания БОРМАШ»",
  },
  {
    id: "15",
    title: "ООО «Курганхиммаш»",
  },
  {
    id: "16",
    title: "АО «Промышленная Компания Теплообменные Технологии»",
  },
  {
    id: "17",
    title: "АО «ТУРБОХОЛОД»",
  },
  {
    id: "18",
    title: "ООО «Чебоксарская электротехника и автоматика»",
  },
  {
    id: "19",
    title: "ЗАО «Нефтеоборудование»",
  },
  {
    id: "20",
    title:
      "ЗАО «Куйбышевский завод автотракторного электрооборудования и карбюраторов»",
  },
  {
    id: "21",
    title: "ЗАО «НИЦ ИНКОМСИСТЕМ»",
  },
  {
    id: "22",
    title: "ООО «СТК Инжиниринг»",
  },
  {
    id: "23",
    title: "АО «ЭлеСи»",
  },
  {
    id: "24",
    title: "ООО «Объединенная нефтяная группа»",
  },
  {
    id: "25",
    title: "ООО «НПП АММА»",
  },
  {
    id: "26",
    title: "ООО «Корпорация Уралтехнострой»",
  },
  {
    id: "28",
    title: "ООО «НПП «Нефтегазинжиниринг»",
  },
  {
    id: "29",
    title: "АО «НПО Гелиймаш»",
  },
  {
    id: "30",
    title: "ООО «Нефть»",
  },
  {
    id: "31",
    title: "АО «ГМС Нефтемаш»",
  },
  {
    id: "32",
    title: "ООО «НПП Томская Электронная Компания»",
  },
  {
    id: "33",
    title: "ООО «НПО Уфанефтегазмаш»",
  },
  {
    id: "34",
    title: "ООО «АВП-ГРУПП»",
  },
  {
    id: "35",
    title: "ЗАО «Роснефтегазмонтаж»",
  },
  {
    id: "36",
    title: "АО «Сибнефтемаш»",
  },
  {
    id: "37",
    title: "ООО «ПТИМАШ»",
  },
  {
    id: "38",
    title: "ОАО «Пензкомпрессормаш»",
  },
  {
    id: "39",
    title: "ООО «Пензнефтехиммаш»",
  },
  {
    id: "41",
    title: "ООО «НПЦ Металлург»",
  },
  {
    id: "42",
    title: "АО «АРТСОК»",
  },
  {
    id: "43",
    title: "ООО «Завод дозировочной техники «Ареопаг»",
  },
  {
    id: "44",
    title: "АО «ОЗНА-Измерительные системы»",
  },
  {
    id: "45",
    title: "ООО НПК «ВОЛГА-АВТОМАТИКА»",
  },
  {
    id: "46",
    title: "АО «Чебоксарский электромеханический завод»",
  },
  {
    id: "47",
    title: "ООО «НПП ГКС»",
  },
  {
    id: "48",
    title: "ООО «Завод Эталон»",
  },
  {
    id: "49",
    title: "ПАО «Газпром автоматизация»",
  },
  {
    id: "51",
    title: "ООО «Пожнефтехим»",
  },
  {
    id: "52",
    title: "ООО «Промышленные системы автоматизации»",
  },
  {
    id: "54",
    title: "ООО ПО «НЕФТЕХИМСТРОЙ»",
  },
  {
    id: "55",
    title: "ООО «Неотехника»",
  },
  {
    id: "57",
    title: "АО «Нефтеавтоматика»",
  },
  {
    id: "58",
    title: "АО «Газстройдеталь»",
  },
  {
    id: "59",
    title: "АО «Казанское моторостроительное производственное объединение»",
  },
  {
    id: "60",
    title: "ЗАО «Волгаспецмаш»",
  },
  {
    id: "61",
    title: "ООО «Тюмень Прибор»",
  },
  {
    id: "62",
    title: "ООО «КРУС-Запад»",
  },
  {
    id: "63",
    title: "ООО «Промстроймонтаж»",
  },
  {
    id: "64",
    title: "ООО ИПК «Промо-Консалтинг»",
  },
  {
    id: "65",
    title: "АО «Давлекановский завод нефтяного машиностроения»",
  },
  {
    id: "66",
    title: "ООО «ТСН-Электро»",
  },
  {
    id: "67",
    title: "АО «СКАД тех»",
  },
  {
    id: "68",
    title: "ООО «ДЕНВАЛ»",
  },
  {
    id: "69",
    title: "ООО «Метрология и Автоматизация»",
  },
  {
    id: "70",
    title: "АО «НПО Энергомаш» им. академика В.П. Глушко",
  },
  {
    id: "71",
    title: "ООО «Кельвион Машимпэкс»",
  },
  {
    id: "72",
    title: "ООО «Октябрьскхиммаш»",
  },
  {
    id: "73",
    title: "ООО «Полюс Автоматика»",
  },
  {
    id: "74",
    title: "ООО «Озерский завод энергоустановок»",
  },
  {
    id: "75",
    title: "АО «ХОНЕВЕЛЛ»",
  },
  {
    id: "76",
    title: "ООО «Титан-Энерго»",
  },
  {
    id: "77",
    title: "ООО «МЭТЗ-Энерго»",
  },
  {
    id: "78",
    title: "ОАО «Волгограднефтемаш»",
  },
  {
    id: "79",
    title: "ООО ПБ «Стил инжиниринг»",
  },
  {
    id: "80",
    title: "ООО «Уралспецгрупп»",
  },
  {
    id: "81",
    title: "ООО «Уфанефтемаш»",
  },
  {
    id: "82",
    title: "ООО «Металлсервис»",
  },
  {
    id: "83",
    title: "АО «Казанькомпрессормаш»",
  },
  {
    id: "84",
    title: "ООО НПФ «ВИСМА»",
  },
  {
    id: "85",
    title: "ООО «Вольтер»",
  },
  {
    id: "86",
    title: "ООО «Завод модульных конструкций»",
  },
  {
    id: "87",
    title: "ООО «Нефтемодульстрой»",
  },
  {
    id: "88",
    title: "АО «ГК «Электрощит» – ТМ Самара»",
  },
  {
    id: "89",
    title: "ООО «НПО «ЭЛЕКТРУМ»",
  },
  {
    id: "90",
    title: "ООО «НПП Би-Тэк»",
  },
  {
    id: "91",
    title: "ООО ГлобалТэнксИжиниринг»",
  },
  {
    id: "92",
    title: "ООО «РусТехЭлектро»",
  },
  {
    id: "93",
    title: "«РЭП Холдинг»",
  },
  {
    id: "94",
    title: "ООО «Завод емкостного оборудования»",
  },
  {
    id: "95",
    title: "ООО «Искра-Нефтегаз»",
  },
  {
    id: "96",
    title: "ООО «Мантрак Восток»",
  },
  {
    id: "97",
    title: "АО «ПремьерСтройДизайн»",
  },
  {
    id: "98",
    title: "ООО «Лепрост»",
  },
  {
    id: "99",
    title: "ООО «НПО «ЭКОХИМПРИБОР»",
  },
  {
    id: "100",
    title: "АО «Димитровградхиммаш»",
  },
  {
    id: "101",
    title: "ООО «Синергия-Лидер»",
  },
  {
    id: "102",
    title: "ООО «Экостандарт»",
  },
  {
    id: "103",
    title: "ООО «Энергосервис»",
  },
  {
    id: "104",
    title: "ООО «ИнтерСтрой»",
  },
  {
    id: "105",
    title: "ООО «Роснефтегазмаш»",
  },
  {
    id: "106",
    title: "ООО «НЕФТЕХИММОНТАЖ»",
  },
  {
    id: "107",
    title: "ООО «ССТэнергомонтаж»",
  },
  {
    id: "108",
    title: "АО «Трест Коксохиммонтаж»",
  },
  {
    id: "109",
    title: "ООО «Энергия Тепла»",
  },
  {
    id: "110",
    title: "ООО «Объединенная двигателестроительная корпорация»",
  },
  {
    id: "111",
    title: "АО «ЭНЕРГОПРОМСЕРВИС ИНЖИНИРИНГ»",
  },
  {
    id: "112",
    title: "ООО «Синтез-Инжиниринг»",
  },
  {
    id: "113",
    title: "ООО «ЕСД Групп»",
  },
  {
    id: "114",
    title: "ПАО «Объединенные машиностроительные заводы»",
  },
  {
    id: "115",
    title: "ООО «НПО ПермНефтеГаз»",
  },
  {
    id: "116",
    title: "ООО «Уральский машиностроительный завод»",
  },
  {
    id: "117",
    title: "ООО «Серафимовский опытный завод автоматики и телемеханики»",
  },
  {
    id: "118",
    title: "ООО «АСУ-Про»",
  },
  {
    id: "119",
    title: "ООО «Апстрим технология» ",
  },
  {
    id: "120",
    title: "ООО «Автоматика-Сервис»",
  },
  {
    id: "121",
    title: "ООО «КОМПРЕССОР ГАЗ»",
  },
  {
    id: "122",
    title: "ООО «Промстройком»",
  },
  {
    id: "123",
    title: "ООО «СпецЭлектронМонтаж»",
  },
  {
    id: "124",
    title: "ООО «Стройресурс»",
  },
  {
    id: "125",
    title: "ООО «Альфа Балт Инжиниринг»",
  },
  {
    id: "126",
    title: "ООО «Турбокомпрессор»",
  },
  {
    id: "128",
    title: "АО «Арктех»",
  },
  {
    id: "129",
    title: "ООО «Вымпел Техно ГРУПП»",
  },
  {
    id: "130",
    title: "ООО «Иокогава Электрик СНГ»",
  },
  {
    id: "131",
    title: "АО «ГИДРОМАШСЕРВИС»",
  },
  {
    id: "134",
    title: "ООО «НПО НХП»",
  },
  {
    id: "135",
    title: "АО «Новомет»",
  },
  {
    id: "136",
    title: "АО «НИПОМ»",
  },
  {
    id: "137",
    title: "ООО «АКВА ТЕХНОЛОДЖИ»",
  },
  {
    id: "140",
    title: "ООО «Великолукский механический завод»",
  },
  {
    id: "141",
    title: "ООО «Динамика»",
  },
  {
    id: "142",
    title: "ООО «Завод НГО «ТЕХНОВЕК»",
  },
  {
    id: "143",
    title: "ООО «Завод «Нефтегазоборудование»",
  },
  {
    id: "144",
    title: "ООО «Завод инновационных технологий»",
  },
  {
    id: "146",
    title:
      "ЗАО «Самарский завод котельно-вспомогательного оборудования и трубопроводов»",
  },
  {
    id: "147",
    title: "ООО «КаЭЛ»",
  },
  {
    id: "148",
    title: "ООО «КУЛТЕК»",
  },
  {
    id: "149",
    title: "ООО «Нефтехиммаш»",
  },
  {
    id: "150",
    title: "ООО «Нефтехимкомплектация»",
  },
  {
    id: "151",
    title: "ООО «НГ‑Энерго»",
  },
  {
    id: "152",
    title: "ООО «Прософт-Системы»",
  },
  {
    id: "153",
    title: "ООО «Сименс»",
  },
  {
    id: "154",
    title: "ООО «Эменсон»",
  },
  {
    id: "155",
    title: "ООО «Тюменьэлектро»",
  },
  {
    id: "156",
    title: "АО «СПИК СЗМА»",
  },
  {
    id: "157",
    title: "ООО «Эскон»",
  },
  {
    id: "158",
    title: "Тепловые системы",
  },
  {
    id: "159",
    title: "ПромтехПроект",
  },
  {
    id: "160",
    title: "ООО ПК «ТС Полюс»",
  },
  {
    id: "161",
    title: "ООО «ТД Электроагрегат»",
  },
  {
    id: "162",
    title: "ООО «Шлюмберже»",
  },
  {
    id: "139",
    title: "ООО «АСУ Инжиниринг»",
  },
  {
    id: "145",
    title: "ООО «Интэком»",
  },
  {
    id: "163",
    title: "ООО «Теплоприбор»",
  },
  {
    id: "251",
    title: "Selective Fuse Breaking Technology",
  },
  {
    id: "209",
    title: "ATEN",
  },
  {
    id: "253",
    title: "ООО «ИСП»",
  },
  {
    id: "214",
    title: "FMPS CO., Ltd",
  },
  {
    id: "213",
    title: "Weidmüller Interface",
  },
  {
    id: "168",
    title: "ОАО «Манотомь»",
  },
  {
    id: "218",
    title: "ЗАО «ПО «СПЕЦАВТОМАТИКА»",
  },
  {
    id: "196",
    title: "AUMA",
  },
  {
    id: "238",
    title: "ООО «ЭМИС»",
  },
  {
    id: "27",
    title: "ООО «Гранит»",
  },
  {
    id: "230",
    title: "ООО «НПО СПЕКТРОН»",
  },
  {
    id: "191",
    title: "ООО «СМД»",
  },
  {
    id: "228",
    title: "ЗАО «РИЭЛТА»",
  },
  {
    id: "178",
    title: "ООО «Термобрест»",
  },
  {
    id: "255",
    title: "ООО «НПО РИЗУР»",
  },
  {
    id: "241",
    title: "ОАО «Арзамасский приборостроительный завод им. П.И. Пландина»",
  },
  {
    id: "239",
    title: "ООО «Энергетические и телекоммуникационные системы»",
  },
  {
    id: "193",
    title: "Фирма «Pepperl+Fuchs»",
  },
  {
    id: "243",
    title: "ООО «Пожгазприбор»",
  },
  {
    id: "167",
    title:
      "ООО «Научно-техническое предприятие инженерно-производственный центр»",
  },
  {
    id: "198",
    title: "Фирма «Dwyer»",
  },
  {
    id: "234",
    title: "ООО «ЦИТплюс»",
  },
  {
    id: "186",
    title: "ООО ПК «Тесей»",
  },
  {
    id: "177",
    title: "ООО «Авантаж»",
  },
  {
    id: "211",
    title: "Zelio",
  },
  {
    id: "182",
    title: "Фирма «Hewlett Packard»",
  },
  {
    id: "40",
    title: "ООО «Инновация»",
  },
  {
    id: "56",
    title: "ООО НПП «Аркус-М»",
  },
  {
    id: "189",
    title: "ООО «КБ Пожавтоматика»",
  },
  {
    id: "233",
    title: "ООО «Электротехника и Автоматика»",
  },
  {
    id: "226",
    title: "ЗАО «ТЕРМИКО»",
  },
  {
    id: "165",
    title: "ЗАО «СКБ «Термоприбор»",
  },
  {
    id: "181",
    title: "Фирма «Phoenix Contact»",
  },
  {
    id: "254",
    title: "Vaillant Group",
  },
  {
    id: "221",
    title: "ЗАО «ФлэймСтоп»",
  },
  {
    id: "258",
    title: "ООО НПП «Технопроект»",
  },
  {
    id: "215",
    title: "SOCOMEC UPS",
  },
  {
    id: "164",
    title: "ООО «ФизТех»",
  },
  {
    id: "133",
    title: "ООО «КСТ ЭНЕРГО ИНЖИНИРИНГ»",
  },
  {
    id: "232",
    title: "ООО «Элтех-Сервис»",
  },
  {
    id: "172",
    title: "ЗАО «Росма»",
  },
  {
    id: "184",
    title: "ООО «Спецприбор»",
  },
  {
    id: "170",
    title: "ООО «Delta Electronics»",
  },
  {
    id: "244",
    title: "ООО «Калаининградгазавтоматика»",
  },
  {
    id: "256",
    title: "BELIMO AutomationBELIMO Automation",
  },
  {
    id: "216",
    title: "Thompson Valves LTD",
  },
  {
    id: "202",
    title: "ООО «НПП «Магнито-контакт»",
  },
  {
    id: "195",
    title: "STIHL",
  },
  {
    id: "179",
    title: "ООО «ГОРЭЛТЕХ»",
  },
  {
    id: "175",
    title: "АО «Теплоконтроль»",
  },
  {
    id: "204",
    title: "Rosemount",
  },
  {
    id: "180",
    title: "ООО «НПК «Эталон»",
  },
  {
    id: "127",
    title: "ООО «Сонар»",
  },
  {
    id: "185",
    title: "ЗАО ПГ «Метран»",
  },
  {
    id: "205",
    title: "Mean-Well",
  },
  {
    id: "197",
    title: "ICP-DAS",
  },
  {
    id: "187",
    title: "Фирма «MOXA»",
  },
  {
    id: "249",
    title: "ООО «Волсар»",
  },
  {
    id: "194",
    title: "ООО «К-Инжиниринг»",
  },
  {
    id: "132",
    title: "ООО «Когнитосфера»",
  },
  {
    id: "224",
    title: "ООО «Связь инжиниринг»",
  },
  {
    id: "50",
    title: "ООО «Уралтехсистемы»",
  },
  {
    id: "203",
    title: "AccordTec",
  },
  {
    id: "219",
    title: "ЗАО «НПП «ИРВИС»",
  },
  {
    id: "192",
    title: "Фирма «Lenovo»",
  },
  {
    id: "235",
    title: "ООО «Поинт»",
  },
  {
    id: "248",
    title: "ООО «Аякс»",
  },
  {
    id: "207",
    title: "DKC",
  },
  {
    id: "246",
    title: "ООО «НПП «Специнформатика»",
  },
  {
    id: "171",
    title: "GE Sensing EMEA",
  },
  {
    id: "227",
    title: "ООО «КТМ-Сервис»",
  },
  {
    id: "247",
    title: "ООО «Валком»",
  },
  {
    id: "242",
    title: "ООО «Интехсистем»",
  },
  {
    id: "138",
    title: "ООО «БЕРДСКЭНЕРГОПРОМ»",
  },
  {
    id: "190",
    title: "ОАО «ТД ВЭЛАН»",
  },
  {
    id: "236",
    title: "ООО «Завод ПромИнТех»",
  },
  {
    id: "208",
    title: "General Monitors",
  },
  {
    id: "174",
    title: "Фирма «WIKA Alexander Wiegand GmbH & Co. KG»",
  },
  {
    id: "257",
    title: "Polar Bear",
  },
  {
    id: "200",
    title: "ООО «Квазар»",
  },
  {
    id: "53",
    title: "ООО «Линк промоборудование»",
  },
  {
    id: "222",
    title: "ЗАО «ФЕРОН»",
  },
  {
    id: "1",
    title: "Не определен",
  },
  {
    id: "206",
    title: "CHINFA",
  },
  {
    id: "237",
    title: "ООО «Иновационные Системы пожаротушения»",
  },
  {
    id: "225",
    title: "ООО «Оптимальные Коммуникации»",
  },
  {
    id: "199",
    title: "IEK",
  },
  {
    id: "229",
    title: "ЗАО «Электронстандарт-прибор»",
  },
  {
    id: "245",
    title: "ООО «СНВ»",
  },
  {
    id: "220",
    title: "ЗАО «АналитТеплоКонтроль»",
  },
  {
    id: "166",
    title: "ООО «НПП «Элемер»",
  },
  {
    id: "201",
    title: "ООО «ЭРИС»",
  },
  {
    id: "176",
    title: "ООО «ЭКСКОН»",
  },
  {
    id: "169",
    title: "АО «Эридан»",
  },
  {
    id: "210",
    title: "System Sensor",
  },
  {
    id: "173",
    title: "ЗАО «НВП Болид»",
  },
  {
    id: "188",
    title: "ООО ПО «ОВЕН»",
  },
  {
    id: "183",
    title: "Фирма «Rittal»",
  },
  {
    id: "240",
    title: "ЗАО «НПО «Тяжпромарматура»",
  },
  {
    id: "223",
    title: "ООО «ТМ Навигатор»",
  },
  {
    id: "231",
    title: "ООО «ВЕЗА»",
  },
  {
    id: "217",
    title: "STEGO",
  },
  {
    id: "212",
    title: "Kingston",
  },
];

export const summaryListOfEquipmentRequestData: SummaryListOfEquipmentView[] = [
  {
    id: "1",
    project: "Новопортовское НГКМ",
    projectId: "1",
    unit: "ОУУ АСВ",
    unitId: "2",
    subUnit: "Линия учета газа от ЦОГ",
    subUnitId: "1",
    installationLocation: "До крана Г-3",
    questionare: "пока нет",
    equipmentType: "СИ",
    systemType: ["РСУ"],
    tag: "PG-3",
    controlledParameter: "Давление газа на входе линии",
    country: "РФ",
    vendor: "Манотомь",
    facilityTitle: "МП-3-У",
    facilityModification: "н/д",
    factoryNumber: "123456",
    year: "2021",
    month: "03",
    period: "120",
    specification: "н/д",
    description: "",
    cableLog: [],
    impulseLineLog: [],
    metrology: {
      id: "1",
      sloeId: "1",
      unit: "ОУУ АСВ",
      unitId: "2",
      subUnit: "Линия учета газа от ЦОГ",
      subUnitId: "1",
      tag: "PG-3",
      sgroei: "СГРОЕИ",
      measurementArea: "Область измерений",
      meansurementType: "Вид измерений",
      meansureGroup: "группа СИ",
      grsi: "unit-1",
      min: "0",
      max: "10",
      range: "МПа",
      accuracy: "+/-1",
      mpi: "60",
      metrologyType: "Поверка",
      documentType: "Паспорт",
      documentNumber: "№ документа",
      document: "Ссылка на документ",
      counterparty: "Организация, выполнившая поверку",
      fromDate: "2022-05-05 13:34:37.655+03",
      toDate: "2022-05-05 13:34:37.655+03",
      status: "Статус",
      arshin: "https://fgis.gost.ru/fundmetrology/cm/results/1-57128327",
      verificationProcedure: "Ссылка на МП",
      typeApprovalCertificate: "Ссылка на СоУТ",
    },
    signals: [],
  },
  {
    id: "2",
    project: "Новопортовское НГКМ",
    projectId: "1",
    unit: "ОУУ АСВ",
    unitId: "2",
    subUnit: "Линия учета газа от ЦОГ",
    subUnitId: "1",
    installationLocation: "После крана Г-3",
    questionare: "пока нет",
    equipmentType: "СИ",
    systemType: ["РСУ"],
    tag: "PT-3",
    controlledParameter: "Давление газа на входе линии",
    country: "РФ",
    vendor: "Метран",
    facilityTitle: "Метран-150",
    facilityModification: "TG",
    factoryNumber: "678678",
    year: "2022",
    month: "04",
    period: "120",
    specification: "н/д",
    description: "",
    cableLog: [
      {
        id: "1",
        sloeId: "2",
        unit: "ОУУ АСВ",
        unitId: "2",
        subUnit: "Линия учета газа от ЦОГ",
        subUnitId: "1",
        tag: "PT-3",
        wiringDiagramTitle: "wiring-diagram-title",
        numberOfTrace: "number-of-trace",
        cableMark: "cable-mark",
        cableSection: "cable-section",
        fromUnit: "from-unit",
        fromPlace: "fromPlace",
        toUnit: "toUnit",
        toPlace: "toPlace",
        cableLenght: "250",
        range: "м",
        description: "description",
      },
    ],
    impulseLineLog: [
      {
        id: "1",
        sloeId: "2",
        unit: "ОУУ АСВ",
        unitId: "2",
        subUnit: "Линия учета газа от ЦОГ",
        subUnitId: "1",
        tag: "PT-3",
        numberOfTrace: "number-1",
        impulseLineType: "type-1",
        fromPlace: "from-1",
        toPlace: "to-1",
        impulseLineLenght: "34",
        range: "м",
        description: "description-1",
      },
    ],
    metrology: {
      id: "2",
      sloeId: "2",
      unit: "ОУУ АСВ",
      unitId: "2",
      subUnit: "Линия учета газа от ЦОГ",
      subUnitId: "1",
      tag: "PT-3",
      sgroei: "СГРОЕИ",
      measurementArea: "Область измерений",
      meansurementType: "Вид измерений",
      meansureGroup: "группа СИ",
      grsi: "456456",
      min: "0",
      max: "10",
      range: "МПа",
      accuracy: "+/-1",
      mpi: "4",
      metrologyType: "Поверка",
      documentType: "Паспорт",
      documentNumber: "№ документа",
      document: "Ссылка на документ",
      counterparty: "Организация, выполнившая поверку",
      fromDate: "2022-05-05 13:34:37.655+03",
      toDate: "2029-05-05 13:34:37.655+03",
      status: "Статус",
      arshin: "https://fgis.gost.ru/fundmetrology/cm/results/1-57128334",
      verificationProcedure: "Ссылка на МП",
      typeApprovalCertificate: "Ссылка на СоУТ",
    },
    signals: [
      {
        id: "1",
        sloeId: "2",
        unit: "ОУУ АСВ",
        unitId: "2",
        subUnit: "Линия учета газа от ЦОГ",
        subUnitId: "1",
        tag: "PT-3",
        signalType: "type-1",
        signalProtocol: "protocol-1",
        signalTag: "signal-tag-1",
        ll: "from-1",
        l: "to-1",
        h: "34",
        hh: "м",
        emergenceProtocol: "description-1",
      },
    ],
    monitoring: {
      id: "1",
      sloeId: "2",
      unit: "ОУУ АСВ",
      unitId: "2",
      subUnit: "Линия учета газа от ЦОГ",
      subUnitId: "1",
      tag: "PT-3",
      mountDate: "2022-05-05 13:34:37.655+03",
      mountDocument: "mountDocument",
      connectDate: "2022-05-05 13:34:37.655+03",
      connectDocument: "connectDocument",
      testDate: "2022-05-05 13:34:37.655+03",
      testDocument: "testDocument",
      awpDate: "2022-05-05 13:34:37.655+03",
      awpDocument: "awpDocument",
      commisionDate: "2022-05-05 13:34:37.655+03",
      commisionDocument: "commisionDocument",
      description: "Примечание",
    },
  },
];
