import {
  FacilityView,
  SummaryListOfEquipmentView,
} from "../../../../../server/common/types/equipment-accounting";

export const countries = [
  {
    id: 1,
    title: "Австралия",
    value: "Австралия",
  },
  {
    id: 2,
    title: "Австрия",
    value: "Австрия",
  },
  {
    id: 3,
    title: "Азербайджан",
    value: "Азербайджан",
  },
  {
    id: 4,
    title: "Албания",
    value: "Албания",
  },
  {
    id: 5,
    title: "Алжир",
    value: "Алжир",
  },
  {
    id: 6,
    title: "Ангола",
    value: "Ангола",
  },
  {
    id: 7,
    title: "Андорра",
    value: "Андорра",
  },
  {
    id: 8,
    title: "Антигуа и Барбуда",
    value: "Антигуа и Барбуда",
  },
  {
    id: 9,
    title: "Аргентина",
    value: "Аргентина",
  },
  {
    id: 10,
    title: "Армения",
    value: "Армения",
  },
  {
    id: 11,
    title: "Афганистан",
    value: "Афганистан",
  },
  {
    id: 12,
    title: "Багамы",
    value: "Багамы",
  },
  {
    id: 13,
    title: "Бангладеш",
    value: "Бангладеш",
  },
  {
    id: 14,
    title: "Барбадос",
    value: "Барбадос",
  },
  {
    id: 15,
    title: "Бахрейн",
    value: "Бахрейн",
  },
  {
    id: 16,
    title: "Белиз",
    value: "Белиз",
  },
  {
    id: 17,
    title: "Белоруссия",
    value: "Белоруссия",
  },
  {
    id: 18,
    title: "Бельгия",
    value: "Бельгия",
  },
  {
    id: 19,
    title: "Бенин",
    value: "Бенин",
  },
  {
    id: 20,
    title: "Болгария",
    value: "Болгария",
  },
  {
    id: 21,
    title: "Боливия",
    value: "Боливия",
  },
  {
    id: 22,
    title: "Босния и Герцеговина",
    value: "Босния и Герцеговина",
  },
  {
    id: 23,
    title: "Ботсвана",
    value: "Ботсвана",
  },
  {
    id: 24,
    title: "Бразилия",
    value: "Бразилия",
  },
  {
    id: 25,
    title: "Бруней",
    value: "Бруней",
  },
  {
    id: 26,
    title: "Буркина-Фасо",
    value: "Буркина-Фасо",
  },
  {
    id: 27,
    title: "Бурунди",
    value: "Бурунди",
  },
  {
    id: 28,
    title: "Бутан",
    value: "Бутан",
  },
  {
    id: 29,
    title: "Вануату",
    value: "Вануату",
  },
  {
    id: 30,
    title: "Великобритания",
    value: "Великобритания",
  },
  {
    id: 31,
    title: "Венгрия",
    value: "Венгрия",
  },
  {
    id: 32,
    title: "Венесуэла",
    value: "Венесуэла",
  },
  {
    id: 33,
    title: "Восточный Тимор",
    value: "Восточный Тимор",
  },
  {
    id: 34,
    title: "Вьетнам",
    value: "Вьетнам",
  },
  {
    id: 35,
    title: "Габон",
    value: "Габон",
  },
  {
    id: 36,
    title: "Гаити",
    value: "Гаити",
  },
  {
    id: 37,
    title: "Гайана",
    value: "Гайана",
  },
  {
    id: 38,
    title: "Гамбия",
    value: "Гамбия",
  },
  {
    id: 39,
    title: "Гана",
    value: "Гана",
  },
  {
    id: 40,
    title: "Гватемала",
    value: "Гватемала",
  },
  {
    id: 41,
    title: "Гвинея",
    value: "Гвинея",
  },
  {
    id: 42,
    title: "Гвинея-Бисау",
    value: "Гвинея-Бисау",
  },
  {
    id: 43,
    title: "Германия",
    value: "Германия",
  },
  {
    id: 44,
    title: "Гондурас",
    value: "Гондурас",
  },
  {
    id: 45,
    title: "Гренада",
    value: "Гренада",
  },
  {
    id: 46,
    title: "Греция",
    value: "Греция",
  },
  {
    id: 47,
    title: "Грузия",
    value: "Грузия",
  },
  {
    id: 48,
    title: "Дания",
    value: "Дания",
  },
  {
    id: 49,
    title: "Джибути",
    value: "Джибути",
  },
  {
    id: 50,
    title: "Доминика",
    value: "Доминика",
  },
  {
    id: "51",
    title: "Доминиканская Республика",
  },
  {
    id: "52",
    title: "Египет",
  },
  {
    id: "53",
    title: "Замбия",
  },
  {
    id: "54",
    title: "Зимбабве",
  },
  {
    id: "55",
    title: "Израиль",
  },
  {
    id: "56",
    title: "Индия",
  },
  {
    id: "57",
    title: "Индонезия",
  },
  {
    id: "58",
    title: "Иордания",
  },
  {
    id: "59",
    title: "Ирак",
  },
  {
    id: "60",
    title: "Иран",
  },
  {
    id: "61",
    title: "Ирландия",
  },
  {
    id: "62",
    title: "Исландия",
  },
  {
    id: "63",
    title: "Испания",
  },
  {
    id: "64",
    title: "Италия",
  },
  {
    id: "65",
    title: "Йемен",
  },
  {
    id: "66",
    title: "Кабо-Верде",
  },
  {
    id: "67",
    title: "Казахстан",
  },
  {
    id: "68",
    title: "Камбоджа",
  },
  {
    id: "69",
    title: "Камерун",
  },
  {
    id: "70",
    title: "Канада",
  },
  {
    id: "71",
    title: "Катар",
  },
  {
    id: "72",
    title: "Кения",
  },
  {
    id: "73",
    title: "Кипр",
  },
  {
    id: "74",
    title: "Киргизия",
  },
  {
    id: "75",
    title: "Кирибати",
  },
  {
    id: "76",
    title: "Китай",
  },
  {
    id: "77",
    title: "КНДР",
  },
  {
    id: "78",
    title: "Колумбия",
  },
  {
    id: "79",
    title: "Коморы",
  },
  {
    id: "80",
    title: "Конго",
  },
  {
    id: "81",
    title: "ДР Конго",
  },
  {
    id: "82",
    title: "Корея",
  },
  {
    id: "83",
    title: "Коста-Рика",
  },
  {
    id: "84",
    title: "Кот-д’Ивуар",
  },
  {
    id: "85",
    title: "Куба",
  },
  {
    id: "86",
    title: "Кувейт",
  },
  {
    id: "87",
    title: "Лаос",
  },
  {
    id: "88",
    title: "Латвия",
  },
  {
    id: "89",
    title: "Лесото",
  },
  {
    id: "90",
    title: "Либерия",
  },
  {
    id: "91",
    title: "Ливан",
  },
  {
    id: "92",
    title: "Ливия",
  },
  {
    id: "93",
    title: "Литва",
  },
  {
    id: "94",
    title: "Лихтенштейн",
  },
  {
    id: "95",
    title: "Люксембург",
  },
  {
    id: "96",
    title: "Маврикий",
  },
  {
    id: "97",
    title: "Мавритания",
  },
  {
    id: "98",
    title: "Мадагаскар",
  },
  {
    id: "99",
    title: "Малави",
  },
  {
    id: "100",
    title: "Малайзия",
  },
  {
    id: "101",
    title: "Мали",
  },
  {
    id: "102",
    title: "Мальдивы",
  },
  {
    id: "103",
    title: "Мальта",
  },
  {
    id: "104",
    title: "Марокко",
  },
  {
    id: "105",
    title: "Маршалловы Острова",
  },
  {
    id: "106",
    title: "Мексика",
  },
  {
    id: "107",
    title: "Микронезия",
  },
  {
    id: "108",
    title: "Мозамбик",
  },
  {
    id: "109",
    title: "Молдавия",
  },
  {
    id: "110",
    title: "Монако",
  },
  {
    id: "111",
    title: "Монголия",
  },
  {
    id: "112",
    title: "Мьянма",
  },
  {
    id: "113",
    title: "Намибия",
  },
  {
    id: "114",
    title: "Науру",
  },
  {
    id: "115",
    title: "Непал",
  },
  {
    id: "116",
    title: "Нигер",
  },
  {
    id: "117",
    title: "Нигерия",
  },
  {
    id: "118",
    title: "Нидерланды",
  },
  {
    id: "119",
    title: "Никарагуа",
  },
  {
    id: "120",
    title: "Новая Зеландия",
  },
  {
    id: "121",
    title: "Норвегия",
  },
  {
    id: "122",
    title: "ОАЭ",
  },
  {
    id: "123",
    title: "Оман",
  },
  {
    id: "124",
    title: "Пакистан",
  },
  {
    id: "125",
    title: "Палау",
  },
  {
    id: "126",
    title: "Панама",
  },
  {
    id: "127",
    title: "Папуа — Новая Гвинея",
  },
  {
    id: "128",
    title: "Парагвай",
  },
  {
    id: "129",
    title: "Перу",
  },
  {
    id: "130",
    title: "Польша",
  },
  {
    id: "131",
    title: "Португалия",
  },
  {
    id: "132",
    title: "Россия",
  },
  {
    id: "133",
    title: "Руанда",
  },
  {
    id: "134",
    title: "Румыния",
  },
  {
    id: "135",
    title: "Сальвадор",
  },
  {
    id: "136",
    title: "Самоа",
  },
  {
    id: "137",
    title: "Сан-Марино",
  },
  {
    id: "138",
    title: "Сан-Томе и Принсипи",
  },
  {
    id: "139",
    title: "Саудовская Аравия",
  },
  {
    id: "140",
    title: "Северная Македония",
  },
  {
    id: "141",
    title: "Сейшелы",
  },
  {
    id: "142",
    title: "Сенегал",
  },
  {
    id: "143",
    title: "Сент-Винсент и Гренадины",
  },
  {
    id: "144",
    title: "Сент-Китс и Невис",
  },
  {
    id: "145",
    title: "Сент-Люсия",
  },
  {
    id: "146",
    title: "Сербия",
  },
  {
    id: "147",
    title: "Сингапур",
  },
  {
    id: "148",
    title: "Сирия",
  },
  {
    id: "149",
    title: "Словакия",
  },
  {
    id: "150",
    title: "Словения",
  },
  {
    id: "151",
    title: "США",
  },
  {
    id: "152",
    title: "Соломоновы Острова",
  },
  {
    id: "153",
    title: "Сомали",
  },
  {
    id: "154",
    title: "Судан",
  },
  {
    id: "155",
    title: "Суринам",
  },
  {
    id: "156",
    title: "Сьерра-Леоне",
  },
  {
    id: "157",
    title: "Таджикистан",
  },
  {
    id: "158",
    title: "Таиланд",
  },
  {
    id: "159",
    title: "Танзания",
  },
  {
    id: "160",
    title: "Того",
  },
  {
    id: "161",
    title: "Тонга",
  },
  {
    id: "162",
    title: "Тринидад и Тобаго",
  },
  {
    id: "163",
    title: "Тувалу",
  },
  {
    id: "164",
    title: "Тунис",
  },
  {
    id: "165",
    title: "Туркмения",
  },
  {
    id: "166",
    title: "Турция",
  },
  {
    id: "167",
    title: "Уганда",
  },
  {
    id: "168",
    title: "Узбекистан",
  },
  {
    id: "169",
    title: "Украина",
  },
  {
    id: "170",
    title: "Уругвай",
  },
  {
    id: "171",
    title: "Фиджи",
  },
  {
    id: "172",
    title: "Филиппины",
  },
  {
    id: "173",
    title: "Финляндия",
  },
  {
    id: "174",
    title: "Франция",
  },
  {
    id: "175",
    title: "Хорватия",
  },
  {
    id: "176",
    title: "ЦАР",
  },
  {
    id: "177",
    title: "Чад",
  },
  {
    id: "178",
    title: "Черногория",
  },
  {
    id: "179",
    title: "Чехия",
  },
  {
    id: "180",
    title: "Чили",
  },
  {
    id: "181",
    title: "Швейцария",
  },
  {
    id: "182",
    title: "Швеция",
  },
  {
    id: "183",
    title: "Шри-Ланка",
  },
  {
    id: "184",
    title: "Эквадор",
  },
  {
    id: "185",
    title: "Экваториальная Гвинея",
  },
  {
    id: "186",
    title: "Эритрея",
  },
  {
    id: "187",
    title: "Эсватини",
  },
  {
    id: "188",
    title: "Эстония",
  },
  {
    id: 189,
    title: "Эфиопия",
    value: "Эфиопия",
  },
  {
    id: 190,
    title: "ЮАР",
    value: "ЮАР",
  },
  {
    id: 191,
    title: "Южный Судан",
    value: "Южный Судан",
  },
  {
    id: 192,
    title: "Ямайка",
    value: "Ямайка",
  },
  {
    id: 193,
    title: "Япония",
    value: "Япония",
  },
];

export const meansurementArea = [
  {
    id: "1",
    title: "Измерения геометрические",
    value: "Измерения геометрические",
  },
  {
    id: "2",
    title: "Измерения механические",
    value: "Измерения механические",
  },
  {
    id: "3",
    title: "Измерения расхода, вместимости, уровня, параметров потока",
    value: "Измерения расхода, вместимости, уровня, параметров потока",
  },
  {
    id: "4",
    title: "Измерения давления и вакуума",
    value: "Измерения давления и вакуума",
  },
  {
    id: "5",
    title: "Измерения физико-химические",
    value: "Измерения физико-химические",
  },
  {
    id: "6",
    title: "Измерения температурные и теплофизические",
    value: "Измерения температурные и теплофизические",
  },
  {
    id: "7",
    title: "Измерения времени и частоты",
    value: "Измерения времени и частоты",
  },
  {
    id: "8",
    title: "Измерения электрические и магнитные",
    value: "Измерения электрические и магнитные",
  },
  {
    id: "9",
    title: "Измерения радиоэлектронные",
    value: "Измерения радиоэлектронные",
  },
  {
    id: "10",
    title: "Измерения виброакустические",
    value: "Измерения виброакустические",
  },
  {
    id: "11",
    title: "Измерения оптические и отпико-физические",
    value: "Измерения оптические и отпико-физические",
  },
  {
    id: "12",
    title: "Измерения параметров ионизирующих излучений",
    value: "Измерения параметров ионизирующих излучений",
  },
  {
    id: "13",
    title: "Измерения биологические и биомедицинские",
    value: "Измерения биологические и биомедицинские",
  },
];

export const meansurementType = [
  {
    id: "1",
    title: "Измерения линейных величин",
    value: "Измерения линейных величин",
  },
  {
    id: "2",
    title: "Измерения угловых величин",
    value: "Измерения угловых величин",
  },
  {
    id: "3",
    title: "Измерения массы",
    value: "Измерения массы",
  },
  {
    id: "4",
    title: "Измерения силы, твердости, силы тяжести",
    value: "Измерения силы, твердости, силы тяжести",
  },
  {
    id: "5",
    title: "Измерения параметров движения",
    value: "Измерения параметров движения",
  },
  {
    id: "6",
    title: "Измерения деформаций, моментов сил, работы, мощности",
    value: "Измерения деформаций, моментов сил, работы, мощности",
  },
  {
    id: "7",
    title: "Измерения системы автосервиса",
    value: "Измерения системы автосервиса",
  },
  {
    id: "8",
    title: "Измерения расхода газов, жидкостей,пара, газожидкостных систем",
    value: "Измерения расхода газов, жидкостей,пара, газожидкостных систем",
  },
  {
    id: "9",
    title: "Измерения уровня, объема, вместимости",
    value: "Измерения уровня, объема, вместимости",
  },
  {
    id: "10",
    title: "Измерения давления, вакуумные",
    value: "Измерения давления, вакуумные",
  },
  {
    id: "11",
    title: "Физико-химические измерения состава твёрдых тел, жидкостей, газов",
    value: "Физико-химические измерения состава твёрдых тел, жидкостей, газов",
  },
  {
    id: "12",
    title:
      "Измерения свойств твёрдых тел, сыпучих веществ, жидкостей, морской воды, нефти",
    value:
      "Измерения свойств твёрдых тел, сыпучих веществ, жидкостей, морской воды, нефти",
  },
  {
    id: "13",
    title: "Измерения количества теплоты реакций и фазовых переходов",
    value: "Измерения количества теплоты реакций и фазовых переходов",
  },
  {
    id: "14",
    title:
      "Измерения температур, в т.ч. низких (ниже 273,15 К) и высоких (более 3000 К)",
    value:
      "Измерения температур, в т.ч. низких (ниже 273,15 К) и высоких (более 3000 К)",
  },
  {
    id: "15",
    title: "Методы и средства воспроизведения и хранения времени и частоты",
    value: "Методы и средства воспроизведения и хранения времени и частоты",
  },
  {
    id: "16",
    title: "Измерения интервалов времени",
    value: "Измерения интервалов времени",
  },
  {
    id: "17",
    title: "Измерения частоты сигналов",
    value: "Измерения частоты сигналов",
  },
  {
    id: "18",
    title: "Измерения параметров телефонной связи, в т.ч. сотовой",
    value: "Измерения параметров телефонной связи, в т.ч. сотовой",
  },
  {
    id: "19",
    title: "Измерения энергетических параметров",
    value: "Измерения энергетических параметров",
  },
  {
    id: "20",
    title:
      "Измерения электрического сопротивления, проводимости, емкости, угла сдвига фаз",
    value:
      "Измерения электрического сопротивления, проводимости, емкости, угла сдвига фаз",
  },
  {
    id: "21",
    title:
      "Измерения характеристик магнитных полей, свойств магнитных материалов",
    value:
      "Измерения характеристик магнитных полей, свойств магнитных материалов",
  },
  {
    id: "22",
    title: "Измерения и исследования формы сигнала и спектра",
    value: "Измерения и исследования формы сигнала и спектра",
  },
  {
    id: "23",
    title: "Измерения ослаблений. Аттенюаторы.",
    value: "Измерения ослаблений. Аттенюаторы.",
  },
  {
    id: "24",
    title: "Генераторы измерительные",
    value: "Генераторы измерительные",
  },
  {
    id: "25",
    title:
      "Измерения элементов и трактов с распределенными постоянными (# рефлектометры)",
    value:
      "Измерения элементов и трактов с распределенными постоянными (# рефлектометры)",
  },
  {
    id: "26",
    title: "Приборы для наблюдения и исследования характеристик радиоустройств",
    value: "Приборы для наблюдения и исследования характеристик радиоустройств",
  },
  {
    id: "27",
    title: "Измерения параметров электронных ламп и полупроводниковых приборов",
    value: "Измерения параметров электронных ламп и полупроводниковых приборов",
  },
  {
    id: "28",
    title:
      "Измерительные устройства коаксиальных и волноводных трактов (#вентили коаксиальные)",
    value:
      "Измерительные устройства коаксиальных и волноводных трактов (#вентили коаксиальные)",
  },
  {
    id: "29",
    title: "Измерения мощности",
    value: "Измерения мощности",
  },
  {
    id: "30",
    title: "Измерения напряжений",
    value: "Измерения напряжений",
  },
  {
    id: "31",
    title: "Измерения напряженности поля и радиопомех",
    value: "Измерения напряженности поля и радиопомех",
  },
  {
    id: "32",
    title: "Импульсные измерения",
    value: "Импульсные измерения",
  },
  {
    id: "33",
    title: "Измерения разности фаз и группового времени запаздывания",
    value: "Измерения разности фаз и группового времени запаздывания",
  },
  {
    id: "34",
    title: "Усилители измерительные",
    value: "Усилители измерительные",
  },
  {
    id: "35",
    title: "Блоки радиоизмерительных приборов",
    value: "Блоки радиоизмерительных приборов",
  },
  {
    id: "36",
    title: "Источники питания для измерения и радиоизмерительных приборов",
    value: "Источники питания для измерения и радиоизмерительных приборов",
  },
  {
    id: "37",
    title:
      "Измерения параметров компонентов и цепей с сосредоточенными постоянными (#мегомметры)",
    value:
      "Измерения параметров компонентов и цепей с сосредоточенными постоянными (#мегомметры)",
  },
  {
    id: "38",
    title: "Комплексные измерительные установки",
    мфдгу: "Комплексные измерительные установки",
  },
  {
    id: "40",
    title: "Измерения акустических величин",
    value: "Измерения акустических величин",
  },
  {
    id: "41",
    title: "Оптические и оптико-физические измерения",
    value: "Оптические и оптико-физические измерения",
  },
  {
    id: "42",
    title:
      "Измерения активности, характеристик полей и источников нейтронов (радиометрия) (#детекторы, спектрометры)",
    value:
      "Измерения активности, характеристик полей и источников нейтронов (радиометрия) (#детекторы, спектрометры)",
  },
  {
    id: "43",
    title: "Измерения доз ионизирующих излучений (дозиметрия)",
    value: "Измерения доз ионизирующих излучений (дозиметрия)",
  },
  {
    id: "44",
    title: "Электронно-физическая аппаратура",
    value: "Электронно-физическая аппаратура",
  },
  {
    id: "45",
    title: "Средства измерения медицинского назначения",
    value: "Средства измерения медицинского назначения",
  },
  {
    id: "39",
    title: "Прочие (радиоэлектронные измерения (#тестеры))",
    value: "Прочие (радиоэлектронные измерения (#тестеры))",
  },
];

export const meansureGroup = [
  {
    id: "1",
    title: "Средства измерения давления и вакуума",
    value: "Средства измерения давления и вакуума",
    children: [
      {
        id: "1",
        title: "Датчики давления",
        value: "Датчики давления",
      },
      {
        id: "2",
        title:
          "Манометры, вакуумметры, мановакуумметры, напоромеры, тягомеры и тягонапоромеры",
        value:
          "Манометры, вакуумметры, мановакуумметры, напоромеры, тягомеры и тягонапоромеры",
      },
    ],
  },
  {
    id: "2",
    title: "Средства измерения температуры",
    value: "Средства измерения температуры",
    children: [
      {
        id: "3",
        title: "Термометры стеклянные жидкостные",
        value: "Термометры стеклянные жидкостные",
      },
      {
        id: "4",
        title: "Термометры показывающие, биметаллические, манометрические",
        value: "Термометры показывающие, биметаллические, манометрические",
      },
      {
        id: "5",
        title: "Термометры сопротивления",
        value: "Термометры сопротивления",
      },
      {
        id: "6",
        title: "Термопары, преобразователи термоэлектрические",
        value: "Термопары, преобразователи термоэлектрические",
      },
      {
        id: "7",
        title: "Датчики температуры с унифицированным выходным сигналом",
        value: "Датчики температуры с унифицированным выходным сигналом",
      },
      {
        id: "8",
        title:
          "Преобразователи измерительные сигналов термометров сопротивления и термоэлектрических преобразователей",
        value:
          "Преобразователи измерительные сигналов термометров сопротивления и термоэлектрических преобразователей",
      },
    ],
  },
  {
    id: "3",
    title: "Средства измерения расхода, вместимости, уровня, параметров потока",
    value: "Средства измерения расхода, вместимости, уровня, параметров потока",
    children: [
      {
        id: "9",
        title: "Счетчики, расходомеры жидкости объемные (проливной метод)",
        value: "Счетчики, расходомеры жидкости объемные (проливной метод)",
      },
      {
        id: "10",
        title: "Счетчики, расходомеры жидкости объемные (имитационный метод)",
        value: "Счетчики, расходомеры жидкости объемные (имитационный метод)",
      },
      {
        id: "11",
        title: "Счетчики, расходомеры жидкости  массовые",
        value: "Счетчики, расходомеры жидкости  массовые",
      },
      {
        id: "12",
        title: "Счетчики, расходомеры газа (проливной метод)",
        value: "Счетчики, расходомеры газа (проливной метод)",
      },
      {
        id: "13",
        title: "Счетчики, расходомеры газа (имитационный метод)",
        value: "Счетчики, расходомеры газа (имитационный метод)",
      },
      {
        id: "14",
        title: "ТПУ, пруверы",
        value: "ТПУ, пруверы",
      },
      {
        id: "15",
        title: "Топливо-раздаточные колонки",
        value: "Топливо-раздаточные колонки",
      },
      {
        id: "16",
        title: "Системы и узлы учета жидкости (СИКН, СИКНС, СИКНП)",
        value: "Системы и узлы учета жидкости (СИКН, СИКНС, СИКНП)",
      },
      {
        id: "17",
        title: "Системы учета жидкости в резервуарах",
        value: "Системы учета жидкости в резервуарах",
      },
      {
        id: "18",
        title: "Системы и узлы учета газа (СИКГ)",
        value: "Системы и узлы учета газа (СИКГ)",
      },
      {
        id: "19",
        title: "Автоматические групповые замерные установки",
        value: "Автоматические групповые замерные установки",
      },
      {
        id: "20",
        title: "Вторичная аппаратура, вычислительные комплексы, контроллеры",
        value: "Вторичная аппаратура, вычислительные комплексы, контроллеры",
      },
      {
        id: "21",
        title: "Мерники",
        value: "Мерники",
      },
      {
        id: "23",
        title: "Уровнемеры",
        value: "Уровнемеры",
      },
      {
        id: "24",
        title: "Резервуары горизонтальные цилиндрические",
        value: "Резервуары горизонтальные цилиндрические",
      },
      {
        id: "25",
        title: "Резервуары вертикальные цилиндрические",
        value: "Резервуары вертикальные цилиндрические",
      },
    ],
  },
  {
    id: "6",
    title: "Средства измерения физико-химического состава и свойств",
    value: "Средства измерения физико-химического состава и свойств",
    children: [
      {
        id: "33",
        title: "Вискозиметры поточные",
        value: "Вискозиметры поточные",
      },
      {
        id: "34",
        title: "Газоанализаторы (стационарные)",
        value: "Газоанализаторы (стационарные)",
      },
      {
        id: "35",
        title: "Газоанализаторы (переносные)",
        value: "Газоанализаторы (переносные)",
      },
      {
        id: "36",
        title: "Гигрометры, анализаторы влажности газов",
        value: "Гигрометры, анализаторы влажности газов",
      },
      {
        id: "37",
        title: "Хроматографы газовые",
        value: "Хроматографы газовые",
      },
      {
        id: "38",
        title: "Анализаторы содержания серы в нефти и нефтепродуктах",
        value: "Анализаторы содержания серы в нефти и нефтепродуктах",
      },
      {
        id: "39",
        title: "Средства измерений химико-аналитических лабораторий",
        value: "Средства измерений химико-аналитических лабораторий",
      },
      {
        id: "29",
        title: "Плотномеры жидкости",
        value: "Плотномеры жидкости",
      },
      {
        id: "30",
        title: "Плотномеры газа",
        value: "Плотномеры газа",
      },
      {
        id: "31",
        title: "Влагомеры нефти и нефтепродуктов",
        value: "Влагомеры нефти и нефтепродуктов",
      },
    ],
  },
  {
    id: "7",
    title: "Прочее",
    value: "Прочее",
  },
  {
    id: "4",
    title: "Средства измерения механических величин",
    value: "Средства измерения механических величин",
    children: [
      {
        id: "26",
        title: "Весы",
        value: "Весы",
      },
      {
        id: "27",
        title: "Гири",
        value: "Гири",
      },
    ],
  },
  {
    id: "5",
    title: "Средства измерения вибрации",
    value: "Средства измерения вибрации",
    children: [
      {
        id: "28",
        title:
          "СИ виброскорости, виброускорения, виброперемещения, осевого сдвига",
        value:
          "СИ виброскорости, виброускорения, виброперемещения, осевого сдвига",
      },
    ],
  },
];

export const sgroei = [
  {
    id: "1",
    title: "Осуществление деятельности в области здравоохранения",
    value: "Осуществление деятельности в области здравоохранения",
  },
  {
    id: "2",
    title: "Осуществление ветеринарной деятельности",
  },
  {
    id: "3",
    title: "Осуществление деятельности в области охраны окружающей среды",
    value: "Осуществление деятельности в области охраны окружающей среды",
  },
  {
    id: "4",
    title:
      "Осуществление деятельности в области гражданской обороны, защиты населения и территорий от чрезвычайных ситуаций природного и техногенного характера, обеспечения пожарной безопасности, безопасности людей на водных объектах",
    value:
      "Осуществление деятельности в области гражданской обороны, защиты населения и территорий от чрезвычайных ситуаций природного и техногенного характера, обеспечения пожарной безопасности, безопасности людей на водных объектах",
  },
  {
    id: "5",
    title: "Выполнение работ по обеспечению безопасных условий и охраны труда",
    value: "Выполнение работ по обеспечению безопасных условий и охраны труда",
  },
  {
    id: "6",
    title:
      "Осуществление производственного контроля за соблюдением установленных законодательством Российской Федерации требований промышленной безопасности к эксплуатации опасного производственного объекта",
    value:
      "Осуществление производственного контроля за соблюдением установленных законодательством Российской Федерации требований промышленной безопасности к эксплуатации опасного производственного объекта",
  },
  {
    id: "7",
    title: "Осуществление торговли, выполнение работ по расфасовке товаров",
    value: "Осуществление торговли, выполнение работ по расфасовке товаров",
  },
  {
    id: "8",
    title:
      "Выполнение государственных учетных операций и учет количества энергетических ресурсов",
    value:
      "Выполнение государственных учетных операций и учет количества энергетических ресурсов",
  },
  {
    id: "9",
    title:
      "Оказание услуг почтовой связи, учет объема оказанных услуг электросвязи операторами связи и обеспечение целостности и устойчивости функционирования сети связи общего пользования",
    value:
      "Оказание услуг почтовой связи, учет объема оказанных услуг электросвязи операторами связи и обеспечение целостности и устойчивости функционирования сети связи общего пользования",
  },
  {
    id: "10",
    title: "Осуществление геодезической и картографической деятельности",
    value: "Осуществление геодезической и картографической деятельности",
  },
  {
    id: "11",
    title:
      "Осуществление деятельности в области гидрометеорологии, мониторинга состояния и загрязнения окружающей среды",
    value:
      "Осуществление деятельности в области гидрометеорологии, мониторинга состояния и загрязнения окружающей среды",
  },
  {
    id: "12",
    title:
      "Проведение банковских, налоговых, таможенных операций и таможенного контроля",
    value:
      "Проведение банковских, налоговых, таможенных операций и таможенного контроля",
  },
  {
    id: "13",
    title:
      "Выполнение работ по оценке соответствия продукции и иных объектов обязательным требованиям в соответствии с законодательством Российской Федерации о техническом регулировании",
    value:
      "Выполнение работ по оценке соответствия продукции и иных объектов обязательным требованиям в соответствии с законодательством Российской Федерации о техническом регулировании",
  },
  {
    id: "14",
    title:
      "Проведение официальных спортивных соревнований, обеспечении подготовки спортсменов высокого класса",
    value:
      "Проведение официальных спортивных соревнований, обеспечении подготовки спортсменов высокого класса",
  },
  {
    id: "15",
    title:
      "Выполнение поручений суда, органов прокуратуры, государственных органов исполнительной власти",
    value:
      "Выполнение поручений суда, органов прокуратуры, государственных органов исполнительной власти",
  },
  {
    id: "16",
    title: "Осуществление мероприятий государственного контроля (надзора)",
    value: "Осуществление мероприятий государственного контроля (надзора)",
  },
  {
    id: "17",
    title: "Осуществление деятельности в области использования атомной энергии",
    value: "Осуществление деятельности в области использования атомной энергии",
  },
  {
    id: "18",
    title: "Обеспечение безопасности дорожного движения",
    value: "Обеспечение безопасности дорожного движения",
  },
  {
    id: "19",
    title:
      "Измерения, предусмотренные законодательством Российской Федерации о техническом регулировании",
    value:
      "Измерения, предусмотренные законодательством Российской Федерации о техническом регулировании",
  },
  {
    id: "20",
    title:
      "Единицы величин, эталоны единиц величин, стандартные образцы и средства измерений, к которым установлены обязательные требования",
    value:
      "Единицы величин, эталоны единиц величин, стандартные образцы и средства измерений, к которым установлены обязательные требования",
  },
  {
    id: "21",
    title:
      "Деятельность вне сферы государственного регулирования обеспечения единства измерений",
    value:
      "Деятельность вне сферы государственного регулирования обеспечения единства измерений",
  },
];

export const metrologyDocumentType = [
  {
    id: 1,
    title: "Извещение о непригодности",
    value: "Извещение о непригодности",
  },
  {
    id: 2,
    title: "Клеймо",
    value: "Клеймо",
  },
  {
    id: 3,
    title: "Паспорт",
    value: "Паспорт",
  },
  {
    id: 4,
    title: "Свидетельство о поверке",
    value: "Свидетельство о поверке",
  },
  {
    id: 5,
    title: "Сертификат калибровки",
    value: "Сертификат калибровки",
  },
];

export const metrologyStatus = [
  {
    id: 1,
    title: "В поверке/калибровке",
    value: "В поверке/калибровке",
  },
  {
    id: 2,
    title: "В работе",
    value: "В работе",
  },
  {
    id: 3,
    title: "В ремонте",
    value: "В ремонте",
  },
  {
    id: 4,
    title: "Консервация",
    value: "Консервация",
  },
  {
    id: 5,
    title: "Непригоден",
    value: "Непригоден",
  },
  {
    id: 6,
    title: "Списан",
    value: "Списан",
  },
];

export const summaryListOfEquipmentRequestData: SummaryListOfEquipmentView[] = [
  {
    id: "1",
    project: "Новопортовское НГКМ",
    projectId: "1",
    unit: "ОУУ АСВ",
    unitId: "2",
    subUnit: "Линия учета газа от ЦОГ",
    subUnitId: "1",
    facilityId: "5",
    facility: {
      id: "5",
      equipmentType: "СИ",
      country: "РФ",
      vendor: "Манотомь",
      title: "МП3-У",
      modifications: ["н/д"],
    },
    facilityModification: "",
    installationLocation: "До крана Г-3",
    questionare: null,

    systemType: ["РСУ"],
    tag: "PG-3",
    controlledParameter: "Давление газа на входе линии",

    factoryNumber: "123456",
    year: "2021",
    month: "03",
    period: "120",
    specification: "н/д",
    description: "",
    cableLog: [],
    impulseLineLog: [],
    metrology: {
      id: "1",
      sloeId: "1",
      unit: "ОУУ АСВ",
      unitId: "2",
      subUnit: "Линия учета газа от ЦОГ",
      subUnitId: "1",
      counterpartyId: 1,
      tag: "PG-3",
      sgroei: "СГРОЕИ",
      measurementArea: "Область измерений",
      meansurementType: "Вид измерений",
      meansureGroup: "группа СИ",
      grsi: "unit-1",
      min: "0",
      max: "10",
      range: "МПа",
      accuracy: "+/-1",
      mpi: "60",
      metrologyType: "Поверка",
      documentType: "Паспорт",
      documentNumber: "№ документа",
      document: "Ссылка на документ",
      counterparty: "Организация, выполнившая поверку",
      fromDate: "2022-05-05 13:34:37.655+03",
      toDate: "2022-05-05 13:34:37.655+03",
      status: "Статус",
      arshin: "https://fgis.gost.ru/fundmetrology/cm/results/1-57128327",
      verificationProcedure: "Ссылка на МП",
      typeApprovalCertificate: "Ссылка на СоУТ",
    },
    signals: [],
  },
  {
    id: "2",
    project: "Новопортовское НГКМ",
    projectId: "1",
    unit: "ОУУ АСВ",
    unitId: "2",
    subUnit: "Линия учета газа от ЦОГ",
    subUnitId: "1",
    facilityId: "6",
    facility: {
      id: "6",
      equipmentType: "СИ",
      country: "РФ",
      vendor: "Метран",
      title: "МЕТРАН-150",
      modifications: ["TG"],
    },
    installationLocation: "После крана Г-3",

    systemType: ["РСУ"],
    tag: "PT-3",
    controlledParameter: "Давление газа на входе линии",
    facilityModification: "TG",
    factoryNumber: "678678",
    year: "2022",
    month: "04",
    period: "120",
    specification: "н/д",
    description: "",
    cableLog: [
      {
        id: "1",
        sloeId: "2",
        unit: "ОУУ АСВ",
        unitId: "2",
        subUnit: "Линия учета газа от ЦОГ",
        subUnitId: "1",
        tag: "PT-3",
        wiringDiagram: null,
        numberOfTrace: "number-of-trace",
        cableMark: "cable-mark",
        cableSection: "cable-section",
        fromUnit: "from-unit",
        fromPlace: "fromPlace",
        toUnit: "toUnit",
        toPlace: "toPlace",
        cableLenght: "250",
        range: "м",
        description: "description",
      },
    ],
    impulseLineLog: [
      {
        id: "1",
        sloeId: "2",
        unit: "ОУУ АСВ",
        unitId: "2",
        subUnit: "Линия учета газа от ЦОГ",
        subUnitId: "1",
        tag: "PT-3",
        numberOfTrace: "number-1",
        impulseLineType: "type-1",
        fromPlace: "from-1",
        toPlace: "to-1",
        impulseLineLenght: "34",
        range: "м",
        description: "description-1",
      },
    ],
    metrology: {
      id: "2",
      sloeId: "2",
      unit: "ОУУ АСВ",
      unitId: "2",
      subUnit: "Линия учета газа от ЦОГ",
      subUnitId: "1",
      counterpartyId: 1,
      tag: "PT-3",
      sgroei: "СГРОЕИ",
      measurementArea: "Область измерений",
      meansurementType: "Вид измерений",
      meansureGroup: "группа СИ",
      grsi: "456456",
      min: "0",
      max: "10",
      range: "МПа",
      accuracy: "+/-1",
      mpi: "4",
      metrologyType: "Поверка",
      documentType: "Паспорт",
      documentNumber: "№ документа",
      document: "Ссылка на документ",
      counterparty: "Организация, выполнившая поверку",
      fromDate: "2022-05-05 13:34:37.655+03",
      toDate: "2029-05-05 13:34:37.655+03",
      status: "Статус",
      arshin: "https://fgis.gost.ru/fundmetrology/cm/results/1-57128334",
      verificationProcedure: "Ссылка на МП",
      typeApprovalCertificate: "Ссылка на СоУТ",
    },
    signals: [
      {
        id: "1",
        sloeId: "2",
        unit: "ОУУ АСВ",
        unitId: "2",
        subUnit: "Линия учета газа от ЦОГ",
        subUnitId: "1",
        tag: "PT-3",
        signalType: "type-1",
        signalProtocol: "protocol-1",
        signalTag: "signal-tag-1",
        ll: "6.3",
        l: "5.3",
        h: "5",
        hh: "6.7",
        emergencyProtocol: "description-1",
      },
    ],
    monitoring: {
      id: "1",
      sloeId: "2",
      unit: "ОУУ АСВ",
      unitId: "2",
      subUnit: "Линия учета газа от ЦОГ",
      subUnitId: "1",
      tag: "PT-3",
      functionalDiagram: null,
      mountDate: "2022-05-05 13:34:37.655+03",
      mountDocument: "mountDocument",
      connectDate: "2022-05-05 13:34:37.655+03",
      connectDocument: "connectDocument",
      testDate: "2022-05-05 13:34:37.655+03",
      testDocument: "testDocument",
      awpDate: "2022-05-05 13:34:37.655+03",
      awpDocument: "awpDocument",
      commisionDate: "2022-05-05 13:34:37.655+03",
      commisionDocument: "commisionDocument",
    },
  },
];

export const facility: FacilityView[] = [
  {
    id: "1",
    country: "РФ",
    vendor: "Метран",
    equipmentType: "СИ",
    title: "Метран 150",
    meansurementArea: null,
    meansurementType: null,
    meansureGroup: null,
    modifications: ["TG", "PDT"],
  },
  {
    id: "2",
    country: "РФ",
    vendor: "Манотомь",
    equipmentType: "СИ",
    title: "МП3-У",
    meansurementArea: null,
    meansurementType: null,
    meansureGroup: null,
    modifications: [],
  },
];
